{
    "date": [
        "2024-06-13",
        "2024-06-12",
        "2024-05-29",
        "2024-05-23",
        "2024-05-20",
        "2024-05-13",
        "2024-04-23",
        "2024-04-19",
        "2024-04-16",
        "2024-04-16",
        "2024-04-08",
        "2024-04-05",
        "2024-03-28",
        "2024-03-28",
        "2024-03-25",
        "2024-03-24",
        "2024-03-06",
        "2024-02-29",
        "2024-02-29",
        "2024-02-24",
        "2024-02-22",
        "2024-02-12",
        "2024-01-27",
        "2024-01-24",
        "2023-12-15",
        "2023-12-14",
        "2023-12-12",
        "2023-12-02",
        "2023-11-21",
        "2023-11-18",
        "2023-11-17",
        "2023-11-01",
        "2023-10-11",
        "2023-10-09",
        "2023-10-09",
        "2023-10-09",
        "2023-07-26",
        "2022-09-22"
    ],
    "player": [
        "Logan Couture",
        "Evander Kane",
        "Troy Stecher",
        "Artturi Lehkonen",
        "Brock Boeser",
        "Valeri Nichushkin",
        "Brett Pesce",
        "Jesper Fast",
        "Bobby McMann",
        "Vince Dunn",
        "Arber Xhekaj",
        "Jake Bean",
        "Ryan Graves",
        "Marcus Foligno",
        "Oskar Sundqvist",
        "Noel Acciari",
        "Logan O'Connor",
        "Ty Emberson",
        "Kent Johnson",
        "Scott Mayfield",
        "Nathan Bastian",
        "Vitek Vanecek",
        "Matthew Poitras",
        "Mattias Samuelsson",
        "Pheonix Copley",
        "Patrik Laine",
        "Matt Benning",
        "Matt Nieto",
        "Milan Lucic",
        "Taylor Hall",
        "John Klingberg",
        "Nicklas Backstrom",
        "Ryan Ellis",
        "Sam Hentges",
        "Jake Muzzin",
        "Tucker Poolman",
        "Matt Murray",
        "Gabriel Landeskog"
    ],
    "team": [
        "San Jose Sharks",
        "Edmonton Oilers",
        "Edmonton Oilers",
        "Colorado Avalanche",
        "Vancouver Canucks",
        "Colorado Avalanche",
        "Carolina Hurricanes",
        "Carolina Hurricanes",
        "Toronto Maple Leafs",
        "Seattle Kraken",
        "Montreal Canadiens",
        "Columbus Blue Jackets",
        "Pittsburgh Penguins",
        "Minnesota Wild",
        "St. Louis Blues",
        "Pittsburgh Penguins",
        "Colorado Avalanche",
        "San Jose Sharks",
        "Columbus Blue Jackets",
        "New York Islanders",
        "New Jersey Devils",
        "San Jose Sharks",
        "Boston Bruins",
        "Buffalo Sabres",
        "Los Angeles Kings",
        "Columbus Blue Jackets",
        "San Jose Sharks",
        "Pittsburgh Penguins",
        "Boston Bruins",
        "Chicago Blackhawks",
        "Toronto Maple Leafs",
        "Washington Capitals",
        "Philadelphia Flyers",
        "Minnesota Wild",
        "Toronto Maple Leafs",
        "Vancouver Canucks",
        "Toronto Maple Leafs",
        "Colorado Avalanche"
    ],
    "teamid": [
        28,
        22,
        22,
        21,
        23,
        21,
        12,
        12,
        10,
        55,
        8,
        29,
        5,
        30,
        19,
        5,
        21,
        28,
        29,
        2,
        1,
        28,
        6,
        7,
        26,
        29,
        28,
        5,
        6,
        16,
        10,
        15,
        4,
        30,
        10,
        23,
        10,
        21
    ],
    "type": [
        "Groin",
        "Hip",
        "Ankle",
        "Shoulder",
        "Blood clotting",
        "NHLPA",
        "Lower body",
        "Upper body",
        "Lower-Body",
        "Upper-Body",
        "Shoulder",
        "Hand",
        "Concussion",
        "Undisclosed",
        "ACL",
        "Lower body",
        "Hip",
        "Lower body",
        "Shoulder",
        "Lower-Body",
        "Upper body",
        "Lower Body",
        "Shoulder",
        "Upper body",
        "Knee",
        "Personal",
        "Lower Body",
        "Knee",
        "Personal",
        "Knee",
        "Hip",
        "Hip",
        "Lower Body",
        "Undisclosed",
        "Back",
        "Head",
        "Hip",
        "Knee"
    ],
    "notes": [
        "Couture (groin) is feeling better and hopes to resume skating in July, Sheng Peng of San Jose Hockey Now reports.",
        "Kane is out for Game 3 against the Florida Panthers on Thursday (June 13).",
        "Stecher is slated to have ankle surgery at some point this summer, per Jason Gregor of Sports 1440 Edmonton.",
        "Lehkonen is expected to undergo a shoulder procedure according to general manager Chris MacFarland, Brennan Vogt of The-Rink.com reports.",
        "Boeser is OUT indefinitely and will not play in Monday's (May 20) game versus Edmonton.",
        "Nichushkin was placed in Stage 3 of the NHL/NHLPA player assistance program and suspended for a minimum of six months without pay for violating the terms of Stage 2, the NHL and NHLPA announced.",
        "Pesce did not play for the remainder of the first-round series against New York. The timetable for return is unclear.",
        "Fast will miss the remainder of the playoffs with an upper body injury. Still has no update or status for return",
        "McMann is making strides in his recovery but is not close to returning to action, Lance Hornby of The Toronto Sun reports.",
        "Dunn is expected to miss the remainder of the 2023-24 season.",
        "Xhekaj will undergo season-ending surgery on his left shoulder on Tuesday (Apr. 9).",
        "Bean suffered a broken hand in Thursday's (Apr. 4) game against the Islanders and will miss the rest of the season.",
        "The Pittsburgh Penguins placed D Ryan Graves on the Injured Reserve.",
        "Foligno will undergo season-ending surgery according to Michael Russo of The Athletic.",
        "The Blues announced that Sundqvist will undergo surgery on his right knee and be re-evaluated in six months.",
        "The Pittsburgh Penguins placed Acciari on Injured Reserve.",
        "The Colorado Avalanche placed O'Connor on injured reserve Monday (Mar. 25), per CapFriendly.",
        "The San Jose Sharks announced D Ty Emberson is not expected to play again this season after head coach David Quinn told reporters Monday (Mar. 25), per Max Miller of The Hockey News.",
        "The Columbus Blue Jackets placed F Kent Johnson on injured reserve.",
        "The New York Islanders announced D Scott Mayfield had successful season-ending surgery. ",
        "The New Jersey Devils placed F Nathan Bastian on Injured Reserve.",
        "Sharks GM Mike Grier said he expects Vanecek to be healthy to start the 2024-2025 season.",
        "The Boston Bruins placed F Matthew Poitras on long-term injured reserve.",
        "The Buffalo Sabres placed D Mattias Samuelsson on Injured Reserve.",
        "The Kings announced that Copley underwent surgery for a torn ACL and is out for the season.",
        "Laine entered the NHL/NHLPA Player Assistance Program and will be out indefinitely.",
        "The Sharks announced that Benning's estimated time of recovery is approximately five months.",
        "Nieto (knee) sustained an undisclosed injury while rehabbing from his knee surgery. The center could find himself heading back under the knife ahead of the 2024-25 campaign, Seth Rorabaugh of Tribune-Review Sports reports.",
        "Lucic will be entering the NHL/NHLPA Player Assistance Program while he remains on indefinite leave.",
        "The Blackhawks announced that Hall underwent successful surgery on his right ACL in (Oct. 2023), but no definite date on a return.",
        "Maple Leafs GM Brad Treliving said Klingberg will undergo surgery.",
        "The Washington Capitals placed F Nicklas Backstrom on Injured Reserve.",
        "The Philadelphia Flyers placed D Ryan Ellis on Injured Reserve.",
        "The Minnesota Wild placed F Sam Hentges on Injured Reserve.",
        "The Toronto Maple Leafs placed D Jake Muzzin on Injured Reserve.",
        "The Vancouver Canucks placed D Tucker Poolman on Injured Reserve.",
        "The Maple Leafs announced that Murray underwent surgery and is expected to miss a minimum of 6-8 months.",
        "The Avalanche announced Landeskog is expected to miss the entire 2023-24 season. There is no return date or update on status for the 2024-2025 season."
    ]
}