{
    "date": [
        "2024-10-04",
        "2024-10-04",
        "2024-10-04",
        "2024-10-04",
        "2024-10-04",
        "2024-10-04",
        "2024-10-04",
        "2024-10-04",
        "2024-10-04",
        "2024-10-04",
        "2024-10-04",
        "2024-10-03",
        "2024-10-03",
        "2024-10-03",
        "2024-10-03",
        "2024-10-02",
        "2024-10-02",
        "2024-10-02",
        "2024-10-02",
        "2024-10-02",
        "2024-10-02",
        "2024-10-01",
        "2024-10-01",
        "2024-10-01",
        "2024-10-01",
        "2024-10-01",
        "2024-09-30",
        "2024-09-28",
        "2024-09-27",
        "2024-09-27",
        "2024-09-26",
        "2024-09-26",
        "2024-09-26",
        "2024-09-26",
        "2024-09-24",
        "2024-09-24",
        "2024-09-24",
        "2024-09-24",
        "2024-09-20",
        "2024-09-20",
        "2024-09-20",
        "2024-09-20",
        "2024-09-19",
        "2024-09-19",
        "2024-09-19",
        "2024-09-19",
        "2024-09-19",
        "2024-09-19",
        "2024-09-19",
        "2024-09-19",
        "2024-09-19",
        "2024-09-19",
        "2024-09-19",
        "2024-09-18",
        "2024-09-18",
        "2024-09-18",
        "2024-09-18",
        "2024-09-18",
        "2024-09-18",
        "2024-09-18",
        "2024-09-17",
        "2024-09-17",
        "2024-09-13",
        "2024-09-12",
        "2024-09-12",
        "2024-09-12",
        "2024-09-03",
        "2024-08-29",
        "2024-08-28",
        "2024-07-25",
        "2024-05-13"
    ],
    "player": [
        "Jack Campbell",
        "Jake Middleton",
        "Matthew Poitras",
        "Matt Boldy",
        "Bryan Rust",
        "William Karlsson",
        "Derek Ryan",
        "Nicholas Robertson",
        "Jake McCabe",
        "Wyatt Kaiser",
        "Calle Jarnkrok",
        "Dmitri Voronkov",
        "Gavin Brindley",
        "Gage Goncalves",
        "Jaret Anderson-Dolan",
        "Jared McCann",
        "Pius Suter",
        "Hunter Shepard",
        "Mackie Samoskevich",
        "Troy Grosenick",
        "Blake Lizotte",
        "Patrik Laine",
        "David Reinbacher",
        "Macklin Celebrini",
        "Vasily Ponomarev",
        "Brad Marchand",
        "Alex Nedeljkovic",
        "Brandon Saad",
        "John Gibson",
        "Santeri Hatakka",
        "Logan Stanley",
        "Martin Pospisil",
        "Drew Doughty",
        "Jake Bean",
        "Ryan Lindgren",
        "Artemi Panarin",
        "Tomas Nosek",
        "Thomas Bordeleau",
        "Ville Heinola",
        "Teddy Blueger",
        "William Carrier",
        "Artyom Levshunov",
        "Shakir Mukhamadullin",
        "Marc-Edouard Vlasic",
        "John Marino",
        "Nick Bjugstad",
        "Oskar Sundqvist",
        "Thatcher Demko",
        "Logan Couture",
        "Kaiden Guhle",
        "Kevin Bahl",
        "Pavel Mintyukov",
        "Brett Pesce",
        "Jason Robertson",
        "T.J. Oshie",
        "Evander Kane",
        "Michael Eyssimont",
        "Luke Glendening",
        "Matt Nieto",
        "Erik Karlsson",
        "Dakota Joshua",
        "Ilya Sorokin",
        "Artturi Lehkonen",
        "Josh Filmon",
        "Quentin Miller",
        "Luke Hughes",
        "Torey Krug",
        "Jesper Fast",
        "Laurent Brossoit",
        "Rafael Harvey-Pinard",
        "Valeri Nichushkin"
    ],
    "team": [
        "Detroit Red Wings",
        "Minnesota Wild",
        "Boston Bruins",
        "Minnesota Wild",
        "Pittsburgh Penguins",
        "Vegas Golden Knights",
        "Edmonton Oilers",
        "Toronto Maple Leafs",
        "Toronto Maple Leafs",
        "Chicago Blackhawks",
        "Toronto Maple Leafs",
        "Columbus Blue Jackets",
        "Columbus Blue Jackets",
        "Tampa Bay Lightning",
        "Winnipeg Jets",
        "Seattle Kraken",
        "Vancouver Canucks",
        "Washington Capitals",
        "Florida Panthers",
        "Minnesota Wild",
        "Pittsburgh Penguins",
        "Montreal Canadiens",
        "Montreal Canadiens",
        "San Jose Sharks",
        "Pittsburgh Penguins",
        "Boston Bruins",
        "Pittsburgh Penguins",
        "St. Louis Blues",
        "Anaheim Ducks",
        "New Jersey Devils",
        "Winnipeg Jets",
        "Calgary Flames",
        "Los Angeles Kings",
        "Calgary Flames",
        "New York Rangers",
        "New York Rangers",
        "Florida Panthers",
        "San Jose Sharks",
        "Winnipeg Jets",
        "Vancouver Canucks",
        "Carolina Hurricanes",
        "Chicago Blackhawks",
        "San Jose Sharks",
        "San Jose Sharks",
        "Utah Hockey Club",
        "Utah Hockey Club",
        "St. Louis Blues",
        "Vancouver Canucks",
        "San Jose Sharks",
        "Montreal Canadiens",
        "Calgary Flames",
        "Anaheim Ducks",
        "New Jersey Devils",
        "Dallas Stars",
        "Washington Capitals",
        "Edmonton Oilers",
        "Tampa Bay Lightning",
        "Tampa Bay Lightning",
        "Pittsburgh Penguins",
        "Pittsburgh Penguins",
        "Vancouver Canucks",
        "New York Islanders",
        "Colorado Avalanche",
        "New Jersey Devils",
        "Montreal Canadiens",
        "New Jersey Devils",
        "St. Louis Blues",
        "Carolina Hurricanes",
        "Chicago Blackhawks",
        "Montreal Canadiens",
        "Colorado Avalanche"
    ],
    "teamid": [
        17,
        30,
        6,
        30,
        5,
        54,
        22,
        10,
        10,
        16,
        10,
        29,
        29,
        14,
        52,
        55,
        23,
        15,
        13,
        30,
        5,
        8,
        8,
        28,
        5,
        6,
        5,
        19,
        24,
        1,
        52,
        20,
        26,
        20,
        3,
        3,
        13,
        28,
        52,
        23,
        12,
        16,
        28,
        28,
        59,
        59,
        19,
        23,
        28,
        8,
        20,
        24,
        1,
        25,
        15,
        22,
        14,
        14,
        5,
        5,
        23,
        2,
        21,
        1,
        8,
        1,
        19,
        12,
        16,
        8,
        21
    ],
    "type": [
        "NHL/NHLPA Player Assistance Program",
        "Upper body",
        "Undisclosed",
        "Lower-body",
        "Lower-body",
        "Undisclosed",
        "Undisclosed",
        "Upper-body",
        "Upper-body",
        "Illness",
        "Lower-body",
        "Upper body",
        "Finger",
        "Upper body",
        "Undisclosed",
        "Lower-body",
        "Upper-body",
        "Lower-body",
        "Upper-body",
        "Knee",
        "Concussion",
        "Knee",
        "Knee",
        "Lower-body",
        "Upper-body",
        "Illness",
        "Lower body",
        "Personal",
        "Appendix",
        "Undisclosed",
        "Knee",
        "Lower-body",
        "Ankle",
        "Lower-body",
        "Upper-body",
        "Lower-body",
        "Upper-body",
        "Lower-body",
        "Ankle",
        "Lower Body",
        "Lower body",
        "Foot",
        "Lower body",
        "Upper-body",
        "Upper-body",
        "Upper-body",
        "Knee",
        "Knee",
        "Groin",
        "Abdomen",
        "Lower body",
        "Lower body",
        "Lower Leg",
        "Foot",
        "Back",
        "Abdomen",
        "Lower body",
        "Undisclosed",
        "Knee",
        "Upper body",
        "Cancer",
        "Back",
        "Shoulder",
        "Upper-body",
        "Shoulder",
        "Shoulder",
        "Ankle",
        "Neck",
        "Meniscus",
        "Leg",
        "NHLPA"
    ],
    "notes": [
        "Campbell will be away from the Red Wings for an indefinite period of time after it was announced Friday that he has entered the NHL/NHLPA Player Assistance Program.",
        "Middleton won't play in Friday's preseason game but is expected to be ready for the season opener.",
        "Head coach Jim Montgomery told reporters that Poitras is still day-to-day and they aren't sure if he'll be ready for the season opener next Tuesday, per Daily Faceoff Fantasy.",
        "Boldy won't play in Friday's preseason game but is expected to be ready for the season opener. ",
        "Rust is day-to-day with a lower-body injury, per Daily Faceoff - Fantasy.",
        "Karlsson won't play in Saturday's preseason game against the Sharks, Jesse Granger of The Athletic reports.",
        "Ryan was late to practice on Friday and only participated in a few drills after it was announced that he was day-to-day with an undisclosed injury.",
        "Robertson is day-to-day with an upper-body injury, per Daily-Faceoff Fantasy.",
        "McCabe is considered day-to-day with an upper-body injury, per Daily Faceoff - Fantasy.",
        "The Chicago Blackhawks placed Kaiser on injured reserve.",
        "Jarnkrok is considered day-to-day with a lower-body injury, per Daily Faceoff Fantasy.",
        "The Columbus Blue Jackets placed Voronkov on injured reserve.",
        "Brindley has been placed on injured reserve and is expected to miss 4 to 6 weeks.",
        "Goncalves is day-to-day with an upper-body injury, Erik Erlendsson of LightningInsider.com reports.",
        "Anderson-Dolan is dealing with an undisclosed injury after blocking a shot against Calgary on Wednesday, Scott Billeck of the Winnipeg Sun reports.",
        "McCann didn't play in Wednesday's (Oct. 2) game versus the Oilers.",
        "Suter is day-to-day with an upper-body injury, per Daily Faceoff - Fantasy.",
        "Shepard wasn't on the ice for Wednesday's practice session due to a lower-body injury, Bailey Johnson of The Washington Post reports.",
        "Samoskevich is hoping to suit up for Saturday's preseason game against the Kings, Jameson Olive of the Panthers' official site reports.",
        "Grosenick underwent successful surgery to repair a torn anterior cruciate ligament in his right knee and will not play this season. He is expected to make a full recovery and be ready for the start of the 2025-26 season.",
        "Lizotte is out indefinitely after being diagnosed with a concussion, Rob Rossi of The Athletic reports.",
        "Laine will not need surgery on his knee but will be sidelined for 2-to-3 months, per Daily Faceoff - Fantasy. ",
        "Reinbacher underwent surgery to his left knee this morning and is out 5-to-6 months.",
        "Celebrini left Tuesday's (Oct. 1) game with a lower body injury after crashing into the boards in the second period.",
        "Ponomarev is being evaluated for an upper-body injury, per head coach Mike Sullivan.",
        "Marchand is questionable to return to Tuesday's preseason game versus the Flyers.",
        "Nedeljkovic is considered week-to-week, Rob Rossi of The Athletic reports.",
        "Brandon Saad said Friday he could miss the season-opening road trip because his wife is expected to deliver their third child at that time.",
        "Gibson underwent emergency appendectomy surgery last night. He is expected to be out approximately 3-6 weeks.",
        "Hatakka is dealing with an injury that is considered more significant than day-to-day, Amanda Stein of the Devils' official site reports.",
        "Stanley will have knee surgery due to a meniscus issue after suffering a tweak during an off-ice pregame routine Wednesday, Mike McIntyre of the Winnipeg Free Press reports Friday. Stanley's expected to be out for at least four weeks.",
        "Pospisil missed a third straight day of practice on Saturday, per Wes Gilbertson of the Calgary Sun.",
        "Doughty underwent successful surgery on his ankle and remains out month to month.",
        "Bean isn't practicing on Saturday (Sept. 28), Wes Gilbertson of the Calgary Sun reports.",
        "Lindgren is expected to be sidelined for 2-3 weeks, Vince Z. Mercogliano of USA Today reports.",
        "Panarin is day-to-day and will not practice on Thursday (Oct. 3).",
        "Nosek is battling an upper-body injury and will miss some time as a result, Jameson Olive of the Panthers' official site reports.",
        "Bordeleau is week-to-week after suffering a lower-body injury, Sheng Peng of San Jose Hockey Now reports.",
        "Heinola who has an ankle infection, underwent surgery, Scott Billeck of the Winnipeg Sun reports Thursday.",
        "F Teddy Blueger won't return versus the Flames on Saturday, Brendan Batchelor of Sportsnet 650 reports.",
        "Carrier will not be an option against the Lightning on Tuesday, Chip Alexander of The Raleigh News & Observer reports.",
        "D Artyom Levshunov is not expected to play in any preseason games. As per Scott Powers of The Athletic.",
        "Mukhamadullin didn't take part in Tuesday's practice, per Curtis Pashelka of The San Jose Mercury News.",
        "Vlasic will be sidelined versus Anaheim on Tuesday, Max Miller of NHL.com reports.",
        "Marino is considered week-to-week with an upper-body injury and will not be on the ice Thursday for the start of training camp, according to Craig Morgan of ALLCITY Network.",
        "Bjugstad will be listed as week-to-week and is not taking part in the start of training camp, per Craig Morgan of ALLCITY Network.",
        "Sundqvist will take part in practices during training camp, but he isn't expected to participate in any preseason games, Jeremy Rutherford of The Athletic reports.",
        "Demko has made a lot of progress over the last 2-3 weeks, but said Thursday there is still no timetable for his return, Harman Dayal of The Athletic reports.",
        "Couture will not be available for the start of training camp, per rotowire.com.",
        "Guhle sported a standard practice jersey on Wednesday (Oct. 2) as he continues to recover from an appendectomy.",
        "Bahl skated with the team on Friday (Sept. 27) for the first time since training camp began last week, according to Pat Steinberg of Sportsnet 960 The Fan.",
        "Mintyukov won't play Tuesday in a preseason game versus the Sharks, Derek Lee of The Hockey News reports.",
        "Pesce didn't play in Friday's (Oct. 4) game versus Buffalo.",
        "Jason Robertson participated in Saturday's practice. Coach Alain Nasreddine remains optimistic about his readiness for the season opener, per NHL TV Analyst Brent Severyn. ",
        "Oshie will be put on long-term injured reserve due to a chronic back injury that's expected to cost him the entire 2024-25 campaign, per Tom Gulitti of NHL.com.",
        "Kaneâ\u0080\u0099s recovery from abdominal surgery is expected to take a minimum of five months. They suggest it could be six months â\u0080\u0094 or longer, per Daniel Nugent-Bowman of The Athletic. ",
        "Eyssimont was originally expected to be out until the middle of October, but he removed his non-contact jersey for Thursday's practice.",
        "Glendening could return by the Oct. 11 opener, Tampa Bay Lightning GM Julien BriseBois said.",
        "Nieto is considered to be month-to-month, per Matt Vensel of the Pittsburgh Post-Gazette.",
        "Karlsson took the ice in a regular sweater with the main group Friday, Michelle Crechiolo of the Penguins' official site reports.",
        "Joshua announced that he underwent surgery for testicular cancer and will not be ready to join the team for training camp.",
        "Coach Patrick Roy said Thursday that he is taking it one day at a time with Sorokin, Andrew Gross of Newsday reports.",
        "Lehkonen was skating in a non-contact jersey during Wednesday's practice session, Evan Rawal of the Denver Gazette reports.",
        "Filmon will not participate in the team's Prospects Challenge due to an upper-body injury and is considered week-to-week.",
        "Miller will be undergoing surgery to repair damage to his right shoulder, per Jonathan Larivee of Hockey Feed.",
        "Hughes has yet to resume skating and remains 5-to-7 weeks away from returning to the Devils' lineup, per Daily Faceoff-Fantasy.",
        "Krug will undergo surgery on his left ankle and will miss the entire 2024-25 season.",
        "Jesper Fast has undergone neck surgery, and is not expected to play in the upcoming season. per Carolina Hurricanes.",
        "Brossoit underwent meniscus repair surgery yesterday, out 5-7 weeks, which puts him back late end of training camp or beginning of regular season, per Frank Seravalli of Daily Faceoff.",
        "Harvey-Pinard underwent successful surgery on Thursday after suffering a broken leg. The recovery period for the 25-year-old winger is estimated to be four months.",
        "Nichushkin was placed in Stage 3 of the NHL/NHLPA player assistance program and suspended for a minimum of six months without pay for violating the terms of Stage 2, the NHL and NHLPA announced."
    ]
}