{
    "date": [
        "2024-09-13",
        "2024-09-12",
        "2024-09-12",
        "2024-09-12",
        "2024-09-03",
        "2024-08-29",
        "2024-08-28",
        "2024-07-25",
        "2024-05-13"
    ],
    "player": [
        "Artturi Lehkonen",
        "Quentin Miller",
        "Josh Filmon",
        "Luke Hughes",
        "Torey Krug",
        "Jesper Fast",
        "Laurent Brossoit",
        "Rafael Harvey-Pinard",
        "Valeri Nichushkin"
    ],
    "team": [
        "Colorado Avalanche",
        "Montreal Canadiens",
        "New Jersey Devils",
        "New Jersey Devils",
        "St. Louis Blues",
        "Carolina Hurricanes",
        "Chicago Blackhawks",
        "Montreal Canadiens",
        "Colorado Avalanche"
    ],
    "teamid": [
        21,
        8,
        1,
        1,
        19,
        12,
        16,
        8,
        21
    ],
    "type": [
        "Shoulder",
        "Upper-body",
        "Upper-body",
        "Shoulder",
        "Ankle",
        "Neck",
        "Meniscus",
        "Leg",
        "NHLPA"
    ],
    "notes": [
        "Lehkonen will not be able to participate fully at the start of training camp, John Matisz of The Score reports.",
        "Miller will not participate in Thursdayâ\u0080\u0099s (Sept. 12) on-ice sessions due to an upper-body injury.",
        "Filmon will not participate in the team's Prospects Challenge due to an upper-body injury and is considered week-to-week.",
        "The New Jersey Devils announced that D Luke Hughes suffered a left shoulder injury earlier this month during off-season training. Hughesâ\u0080\u0099 recovery time is approximately six-eight weeks.",
        "Krug will undergo surgery on his left ankle and will miss the entire 2024-25 season.",
        "Jesper Fast has undergone neck surgery, and is not expected to play in the upcoming season. per Carolina Hurricanes.",
        "Brossoit underwent meniscus repair surgery yesterday, out 5-7 weeks, which puts him back late end of training camp or beginning of regular season, per Frank Seravalli of Daily Faceoff.",
        "Harvey-Pinard underwent successful surgery on Thursday after suffering a broken leg. The recovery period for the 25-year-old winger is estimated to be four months.",
        "Nichushkin was placed in Stage 3 of the NHL/NHLPA player assistance program and suspended for a minimum of six months without pay for violating the terms of Stage 2, the NHL and NHLPA announced."
    ]
}