{
    "date": [
        "2024-05-17",
        "2024-05-15",
        "2024-05-13",
        "2024-05-12",
        "2024-04-23",
        "2024-04-23",
        "2024-04-22",
        "2024-04-19",
        "2024-04-16",
        "2024-04-16",
        "2024-04-08",
        "2024-04-06",
        "2024-04-05",
        "2024-03-31",
        "2024-03-28",
        "2024-03-28",
        "2024-03-28",
        "2024-03-27",
        "2024-03-27",
        "2024-03-25",
        "2024-03-24",
        "2024-03-21",
        "2024-03-19",
        "2024-03-13",
        "2024-03-12",
        "2024-03-12",
        "2024-03-06",
        "2024-02-29",
        "2024-02-29",
        "2024-02-27",
        "2024-02-24",
        "2024-02-22",
        "2024-02-17",
        "2024-02-15",
        "2024-02-12",
        "2024-02-12",
        "2024-02-11",
        "2024-01-28",
        "2024-01-27",
        "2024-01-24",
        "2024-01-03",
        "2023-12-15",
        "2023-12-14",
        "2023-12-12",
        "2023-12-04",
        "2023-12-02",
        "2023-11-28",
        "2023-11-21",
        "2023-11-18",
        "2023-11-17",
        "2023-11-01",
        "2023-10-14",
        "2023-10-11",
        "2023-10-09",
        "2023-10-09",
        "2023-10-09",
        "2023-07-26",
        "2022-09-22"
    ],
    "player": [
        "Yakov Trenin",
        "Roope Hintz",
        "Valeri Nichushkin",
        "Adam Henrique",
        "Thatcher Demko",
        "Brett Pesce",
        "Timo Meier",
        "Jesper Fast",
        "Vince Dunn",
        "Bobby McMann",
        "Arber Xhekaj",
        "Justin Faulk",
        "Jake Bean",
        "Jonas Johansson",
        "Alexander Barabanov",
        "Ryan Graves",
        "Marcus Foligno",
        "Max Jones",
        "Ethan Bear",
        "Oskar Sundqvist",
        "Noel Acciari",
        "Dan Vladar",
        "Jani Hakanpaa",
        "Sean Kuraly",
        "Yegor Chinakhov",
        "Barrett Hayton",
        "Logan O'Connor",
        "Ty Emberson",
        "Kent Johnson",
        "Josh Norris",
        "Scott Mayfield",
        "Nathan Bastian",
        "Brock McGinn",
        "Blake Wheeler",
        "Vitek Vanecek",
        "Logan Couture",
        "Rasmus Ristolainen",
        "Adam Fantilli",
        "Matthew Poitras",
        "Mattias Samuelsson",
        "Jared Spurgeon",
        "Pheonix Copley",
        "Patrik Laine",
        "Matt Benning",
        "Travis Boyd",
        "Matt Nieto",
        "Dougie Hamilton",
        "Milan Lucic",
        "Taylor Hall",
        "John Klingberg",
        "Nicklas Backstrom",
        "Kirby Dach",
        "Ryan Ellis",
        "Sam Hentges",
        "Jake Muzzin",
        "Tucker Poolman",
        "Matt Murray",
        "Gabriel Landeskog"
    ],
    "team": [
        "Colorado Avalanche",
        "Dallas Stars",
        "Colorado Avalanche",
        "Edmonton Oilers",
        "Vancouver Canucks",
        "Carolina Hurricanes",
        "New Jersey Devils",
        "Carolina Hurricanes",
        "Seattle Kraken",
        "Toronto Maple Leafs",
        "Montreal Canadiens",
        "St. Louis Blues",
        "Columbus Blue Jackets",
        "Tampa Bay Lightning",
        "San Jose Sharks",
        "Pittsburgh Penguins",
        "Minnesota Wild",
        "Anaheim Ducks",
        "Washington Capitals",
        "St. Louis Blues",
        "Pittsburgh Penguins",
        "Calgary Flames",
        "Dallas Stars",
        "Columbus Blue Jackets",
        "Columbus Blue Jackets",
        "Arizona Coyotes",
        "Colorado Avalanche",
        "San Jose Sharks",
        "Columbus Blue Jackets",
        "Ottawa Senators",
        "New York Islanders",
        "New Jersey Devils",
        "Anaheim Ducks",
        "New York Rangers",
        "San Jose Sharks",
        "San Jose Sharks",
        "Philadelphia Flyers",
        "Columbus Blue Jackets",
        "Boston Bruins",
        "Buffalo Sabres",
        "Minnesota Wild",
        "Los Angeles Kings",
        "Columbus Blue Jackets",
        "San Jose Sharks",
        "Arizona Coyotes",
        "Pittsburgh Penguins",
        "New Jersey Devils",
        "Boston Bruins",
        "Chicago Blackhawks",
        "Toronto Maple Leafs",
        "Washington Capitals",
        "Montreal Canadiens",
        "Philadelphia Flyers",
        "Minnesota Wild",
        "Toronto Maple Leafs",
        "Vancouver Canucks",
        "Toronto Maple Leafs",
        "Colorado Avalanche"
    ],
    "teamid": [
        21,
        25,
        21,
        22,
        23,
        12,
        1,
        12,
        55,
        10,
        8,
        19,
        29,
        14,
        28,
        5,
        30,
        24,
        15,
        19,
        5,
        20,
        25,
        29,
        29,
        53,
        21,
        28,
        29,
        9,
        2,
        1,
        24,
        3,
        28,
        28,
        4,
        29,
        6,
        7,
        30,
        26,
        29,
        28,
        53,
        5,
        1,
        6,
        16,
        10,
        15,
        8,
        4,
        30,
        10,
        23,
        10,
        21
    ],
    "type": [
        "Upper body",
        "Upper body",
        "NHLPA",
        "Ankle",
        "Knee",
        "Lower body",
        "Shoulder",
        "Upper body",
        "Upper-Body",
        "Lower-Body",
        "Shoulder",
        "Upper-Body",
        "Hand",
        "Lower body",
        "Lower body",
        "Concussion",
        "Undisclosed",
        "Upper-Body ",
        "Personal",
        "ACL",
        "Lower body",
        "Hip",
        "Lower body",
        "Lower body",
        "Upper-Body",
        "Lower body",
        "Hip",
        "Lower body",
        "Shoulder",
        "Upper body",
        "Lower-Body",
        "Upper body",
        "Back",
        "Lower-Body",
        "Lower Body",
        "Groin",
        "Upper Body",
        "Leg",
        "Shoulder",
        "Upper body",
        "Hip/Back",
        "Knee",
        "Collarbone",
        "Lower Body",
        "Pectoral",
        "Knee",
        "Pectoral",
        "Personal",
        "Knee",
        "Hip",
        "Hip",
        "Knee",
        "Lower Body",
        "Undisclosed",
        "Back",
        "Head",
        "Hip",
        "Knee"
    ],
    "notes": [
        "Trenin is OUT for Friday's (May 17) game versus Dallas.",
        "Hintz is OUT for Friday's (May 17) game versus Colorado.",
        "Nichushkin was placed in Stage 3 of the NHL/NHLPA player assistance program and suspended for a minimum of six months without pay for violating the terms of Stage 2, the NHL and NHLPA announced.",
        "Henrique did not play in Thursday's (May 16) game against Vancouver.",
        "Demko joined the Vancouver Canucks for their trip to Nashville for Games 3 and 4 despite being labeled week-to-week, Dan Murphy of Sportsnet reports Thursday.",
        "Pesce is OUT for the remainder of the first-round series against New York.",
        "Meier decided to undergo elective arthroscopic surgery on his shoulder. ",
        "Fast will miss the remainder of the playoffs with an upper body injury.",
        "Dunn is expected to miss the remainder of the 2023-24 season.",
        "McMann is making strides in his recovery but is not close to returning to action, Lance Hornby of The Toronto Sun reports.",
        "Xhekaj will undergo season-ending surgery on his left shoulder on Tuesday (Apr. 9).",
        "Faulk is considered week-to-week and is likely done for the rest of the regular season, per St. Louis Blues site editor/writer Lou Korac.",
        "Bean suffered a broken hand in Thursday's (Apr. 4) game against the Islanders and will miss the rest of the season.",
        "Johansson (lower body) won't return for Sunday's opening game against the Florida Panthers, Chris Krenn of the Tampa Bay Lightning's official site reports.",
        "Barabanov is week-to-week and didn't travel with the team for Thursday's (Mar. 28) game versus Wild, per San Jose Sharks Beat Reporter Max Miller. ",
        "The Pittsburgh Penguins placed D Ryan Graves on the Injured Reserve.",
        "Foligno will undergo season-ending surgery according to Michael Russo of The Athletic.",
        "Jones is OUT with an upper-body injury, per Ducks.",
        "The NHL and NHLPA announced that Bear will be out indefinitely while receiving care from the Player Assistance Program.",
        "The Blues announced that Sundqvist will undergo surgery on his right knee and be re-evaluated in six months.",
        "The Pittsburgh Penguins placed Acciari on Injured Reserve.",
        "The Calgary Flames announced G Dan Vladar will receive season-ending hip surgery next week.",
        "Hakanpaa has not played since March and remains without a timetable for his return.",
        "Kuraly suffered a lower-body injury during Tuesday's (Mar. 12) loss to Montreal, is considered week-to-week, per Coby Maeir of 1st Ohio Battery on Wednesday.",
        "Chinakhov is considered week-to-week, Jeff Svoboda of the Columbus Blue Jackets' official site reports.",
        "Hayton is expected to be out longer than originally anticipated according to team reporter Patrick Brown.",
        "The Colorado Avalanche placed O'Connor on injured reserve Monday (Mar. 25), per CapFriendly.",
        "The San Jose Sharks announced D Ty Emberson is not expected to play again this season after head coach David Quinn told reporters Monday (Mar. 25), per Max Miller of The Hockey News.",
        "The Columbus Blue Jackets placed F Kent Johnson on injured reserve.",
        "The Ottawa Senators announced F Josh Norris had shoulder surgery and will miss the rest of the season.",
        "The New York Islanders announced D Scott Mayfield had successful season-ending surgery. ",
        "The New Jersey Devils placed F Nathan Bastian on Injured Reserve.",
        "The Ducks announced F McGinn underwent successful disc surgery last week and is expected to be out of action for four months.",
        "The New York Rangers placed F Blake Wheeler on Injured Reserve.",
        "Sharks GM Mike Grier said he expects Vanecek to be healthy to start the 2024-2025 season.",
        "Couture said he will not return this season according to Curtis Pashekla of the Bay Area News Group.",
        "Ristolainen underwent surgery on his ruptured triceps tendon. He is expected to be out three months and will make a full recovery.",
        "Columbus Blue Jackets announced C Adam Fantilli is expected to be sidelined for eight weeks due to a calf laceration.",
        "The Boston Bruins placed F Matthew Poitras on long-term injured reserve.",
        "The Buffalo Sabres placed D Mattias Samuelsson on Injured Reserve.",
        "Spurgeon will miss the remainder of the season due to injury according to the Minnesota Wild.",
        "The Kings announced that Copley underwent surgery for a torn ACL and is out for the season.",
        "Laine entered the NHL/NHLPA Player Assistance Program and will be out indefinitely.",
        "The Sharks announced that Benning's estimated time of recovery is approximately five months.",
        "Boyd is expected to miss the rest of the season according to Craig Morgan of PHNX Sports.",
        "Nieto underwent successful laparoscopic surgery on his right knee. Expected recovery is six to eight weeks.",
        "The New Jersey Devils placed D Dougie Hamilton on long-term injured reserve, per James Nichols of New Jersey Hockey Now reports.",
        "Lucic will be entering the NHL/NHLPA Player Assistance Program while he remains on indefinite leave.",
        "The Blackhawks announced that Hall underwent successful surgery on his right ACL.",
        "Maple Leafs GM Brad Treliving said Klingberg will undergo surgery.",
        "The Washington Capitals placed F Nicklas Backstrom on Injured Reserve.",
        "Canadiens GM Kent Hughes announced that Dach underwent successful surgery and is expected to ready for the start of the 2024-25 season.",
        "The Philadelphia Flyers placed D Ryan Ellis on Injured Reserve.",
        "The Minnesota Wild placed F Sam Hentges on Injured Reserve.",
        "The Toronto Maple Leafs placed D Jake Muzzin on Injured Reserve.",
        "The Vancouver Canucks placed D Tucker Poolman on Injured Reserve.",
        "The Maple Leafs announced that Murray underwent surgery and is expected to miss a minimum of 6-8 months.",
        "The Avalanche announced Landeskog is expected to miss the entire 2023-24 season."
    ]
}