{
    "date": [
        "2024-12-20",
        "2024-12-20",
        "2024-12-20",
        "2024-12-19",
        "2024-12-19",
        "2024-12-18",
        "2024-12-17",
        "2024-12-17",
        "2024-12-17",
        "2024-12-17",
        "2024-12-15",
        "2024-12-14",
        "2024-12-14",
        "2024-12-14",
        "2024-12-14",
        "2024-12-14",
        "2024-12-14",
        "2024-12-14",
        "2024-12-13",
        "2024-12-13",
        "2024-12-12",
        "2024-12-12",
        "2024-12-12",
        "2024-12-12",
        "2024-12-11",
        "2024-12-11",
        "2024-12-11",
        "2024-12-11",
        "2024-12-10",
        "2024-12-10",
        "2024-12-07",
        "2024-12-06",
        "2024-12-05",
        "2024-12-04",
        "2024-12-04",
        "2024-12-03",
        "2024-12-02",
        "2024-11-29",
        "2024-11-29",
        "2024-11-29",
        "2024-11-29",
        "2024-11-29",
        "2024-11-28",
        "2024-11-28",
        "2024-11-26",
        "2024-11-25",
        "2024-11-25",
        "2024-11-24",
        "2024-11-20",
        "2024-11-19",
        "2024-11-18",
        "2024-11-16",
        "2024-11-16",
        "2024-11-14",
        "2024-11-13",
        "2024-11-08",
        "2024-11-05",
        "2024-11-01",
        "2024-10-28",
        "2024-10-16",
        "2024-10-15",
        "2024-10-14",
        "2024-10-08",
        "2024-10-08",
        "2024-10-08",
        "2024-10-08",
        "2024-10-07",
        "2024-10-07",
        "2024-10-06",
        "2024-10-04",
        "2024-10-02",
        "2024-10-01",
        "2024-09-29",
        "2024-09-27",
        "2024-09-26",
        "2024-09-19",
        "2024-09-19",
        "2024-09-19",
        "2024-09-18",
        "2024-09-18",
        "2024-09-03",
        "2024-08-29",
        "2024-08-28",
        "2024-08-21",
        "2023-11-01",
        "2022-09-22"
    ],
    "player": [
        "Logan Stanley",
        "Lars Eller",
        "Jesper Boqvist",
        "Nicolas Roy",
        "Curtis Lazar",
        "Simon Edvinsson",
        "Jordan Greenway",
        "Ivan Barbashev",
        "Dante Fabbro",
        "Vitek Vanecek",
        "Filip Gustavsson",
        "Marcus Pettersson",
        "Jakub Lauko",
        "Alec Regula",
        "Yakov Trenin",
        "Anton Forsberg",
        "Trevor Moore",
        "Andrei Kuzmenko",
        "Janis Moser",
        "Craig Smith",
        "Klim Kostin",
        "Anthony Stolarz",
        "Jake Middleton",
        "Jack Drury",
        "Matt Dumba",
        "K'Andre Miller",
        "Justin Danforth",
        "David Gustafsson",
        "Roman Josi",
        "Robert Bortuzzo",
        "Alec Martinez",
        "Nicolas Deslauriers",
        "Semyon Varlamov",
        "Joel Eriksson Ek",
        "Trevor Zegras",
        "Trevor Lewis",
        "Tyler Seguin",
        "Yegor Chinakhov",
        "Justin Kirkland",
        "Oliver Kylington",
        "Maveric Lamoureux",
        "Josh Manson",
        "Filip Hronek",
        "Miles Wood",
        "Artem Zub",
        "David Perron",
        "Jonathan Drouin",
        "Dylan Samberg",
        "Connor Ingram",
        "Ben Hutton",
        "Alex Ovechkin",
        "Jani Hakanpaa",
        "Seth Jones",
        "Jordan Eberle",
        "Hampus Lindholm",
        "Sonny Milano",
        "Anthony Mantha",
        "Mike Reilly",
        "Frederik Andersen",
        "Nick Leddy",
        "Erik Gudbranson",
        "Sean Durzi",
        "Jordan Gustafson",
        "Jakub Demek",
        "Lukas Cormier",
        "Tucker Poolman",
        "Ryan Ellis",
        "Jordan Dumais",
        "Boone Jenner",
        "Calle Jarnkrok",
        "Troy Grosenick",
        "David Reinbacher",
        "Austin Roest",
        "Santeri Hatakka",
        "Drew Doughty",
        "John Marino",
        "Marc-Edouard Vlasic",
        "Logan Couture",
        "T.J. Oshie",
        "Evander Kane",
        "Torey Krug",
        "Jesper Fast",
        "Laurent Brossoit",
        "Igor Chernyshov",
        "Nicklas Backstrom",
        "Gabriel Landeskog"
    ],
    "team": [
        "Winnipeg Jets",
        "Washington Capitals",
        "Florida Panthers",
        "Vegas Golden Knights",
        "New Jersey Devils",
        "Detroit Red Wings",
        "Buffalo Sabres",
        "Vegas Golden Knights",
        "Columbus Blue Jackets",
        "San Jose Sharks",
        "Minnesota Wild",
        "Pittsburgh Penguins",
        "Minnesota Wild",
        "Edmonton Oilers",
        "Minnesota Wild",
        "Ottawa Senators",
        "Los Angeles Kings",
        "Calgary Flames",
        "Tampa Bay Lightning",
        "Chicago Blackhawks",
        "San Jose Sharks",
        "Toronto Maple Leafs",
        "Minnesota Wild",
        "Carolina Hurricanes",
        "Dallas Stars",
        "New York Rangers",
        "Columbus Blue Jackets",
        "Winnipeg Jets",
        "Nashville Predators",
        "Utah Hockey Club",
        "Chicago Blackhawks",
        "Philadelphia Flyers",
        "New York Islanders",
        "Minnesota Wild",
        "Anaheim Ducks",
        "Los Angeles Kings",
        "Dallas Stars",
        "Columbus Blue Jackets",
        "Calgary Flames",
        "Colorado Avalanche",
        "Utah Hockey Club",
        "Colorado Avalanche",
        "Vancouver Canucks",
        "Colorado Avalanche",
        "Ottawa Senators",
        "Ottawa Senators",
        "Colorado Avalanche",
        "Winnipeg Jets",
        "Utah Hockey Club",
        "Vegas Golden Knights",
        "Washington Capitals",
        "Toronto Maple Leafs",
        "Chicago Blackhawks",
        "Seattle Kraken",
        "Boston Bruins",
        "Washington Capitals",
        "Calgary Flames",
        "New York Islanders",
        "Carolina Hurricanes",
        "St. Louis Blues",
        "Columbus Blue Jackets",
        "Utah Hockey Club",
        "Vegas Golden Knights",
        "Vegas Golden Knights",
        "Vegas Golden Knights",
        "Colorado Avalanche",
        "Philadelphia Flyers",
        "Columbus Blue Jackets",
        "Columbus Blue Jackets",
        "Toronto Maple Leafs",
        "Minnesota Wild",
        "Montreal Canadiens",
        "Nashville Predators",
        "New Jersey Devils",
        "Los Angeles Kings",
        "Utah Hockey Club",
        "San Jose Sharks",
        "San Jose Sharks",
        "Washington Capitals",
        "Edmonton Oilers",
        "St. Louis Blues",
        "Carolina Hurricanes",
        "Chicago Blackhawks",
        "San Jose Sharks",
        "Washington Capitals",
        "Colorado Avalanche"
    ],
    "teamid": [
        52,
        15,
        13,
        54,
        1,
        17,
        7,
        54,
        29,
        28,
        30,
        5,
        30,
        22,
        30,
        9,
        26,
        20,
        14,
        16,
        28,
        10,
        30,
        12,
        25,
        3,
        29,
        52,
        18,
        59,
        16,
        4,
        2,
        30,
        24,
        26,
        25,
        29,
        20,
        21,
        59,
        21,
        23,
        21,
        9,
        9,
        21,
        52,
        59,
        54,
        15,
        10,
        16,
        55,
        6,
        15,
        20,
        2,
        12,
        19,
        29,
        59,
        54,
        54,
        54,
        21,
        4,
        29,
        29,
        10,
        30,
        8,
        18,
        1,
        26,
        59,
        28,
        28,
        15,
        22,
        19,
        12,
        16,
        28,
        15,
        21
    ],
    "type": [
        "Lower Body",
        "Illness",
        "Upper-body",
        "Upper Body",
        "Knee",
        "Upper Body",
        "Middle-body",
        "Upper-body",
        "Lower-body",
        "Head",
        "Lower-body",
        "Lower Body",
        "Lower-body",
        "Knee",
        "Upper Body",
        "Undisclosed",
        "Upper-body",
        "Lower Body",
        "Lower-body",
        "Back",
        "Upper-body",
        "Lower Body",
        "Upper Body",
        "Hand",
        "Upper-body",
        "Upper Body",
        "Lower Body",
        "Illness",
        "Lower Body",
        "Lower-body",
        "Neck",
        "Upper-body",
        "Lower-body",
        "Lower-body",
        "Knee",
        "Lower-body",
        "Hip",
        "Upper Body",
        "Lower-body",
        "Upper-body",
        "Upper Body",
        "Upper-body",
        "Upper-Body",
        "Upper-body",
        "Foot",
        "Upper-Body",
        "Upper Body",
        "Foot",
        "Upper-body",
        "Upper Body",
        "Leg",
        "Lower-Body",
        "Foot",
        "Pelvis",
        "Lower-body",
        "Upper-body",
        "Lower-Body",
        "Heart",
        "Knee",
        "Lower Body",
        "Shoulder",
        "Shoulder",
        "Undisclosed",
        "Undisclosed",
        "Undisclosed",
        "Head",
        "Back",
        "Lower Body",
        "Shoulder",
        "Groin",
        "Knee",
        "Knee",
        "Undisclosed",
        "Shoulder",
        "Ankle",
        "Back",
        "Back",
        "Groin",
        "Back",
        "Abdomen",
        "Ankle",
        "Neck",
        "Knee",
        "Shoulder",
        "Hip",
        "Knee"
    ],
    "notes": [
        "The Jets announced on Friday (Dec. 20) that Stanley is expected to be out until after the holiday break.",
        "The Washington Capitals placed F Lars Eller on injured reserve and is OUT for Friday's (Dec. 20) game versus the Capitals.",
        "The Panthers listed Boqvist as OUT for Friday's (Dec. 20) tilt against St. Louis with an upper-body injury, per Colby Guy of The Palm Beach Post.",
        "Roy will not be in the lineup Thursday (Dec. 19) against Vancouver, as he is battling an upper-body injury, Danny Webster of the Las Vegas Review-Journal reports.",
        "The Devils listed Lazar as Out for Thursday's (Dec. 19) game against the Columbus and will likely be shut down until after the Christmas break, according to head coach Sheldon Keefe.",
        "The Red Wings listed Edvinsson as OUT for Friday's (Dec. 20) game against the Canadiens and is not expected to return this weekend.",
        "The Sabres said on Thursday (Dec. 19) that Greenway will be out long-term after getting surgery on a middle-body injury, according to head coach Lindy Ruff.",
        "Barbashev did not play in Thursday's (Dec. 19) game against the Canucks.",
        "Fabbro did not play in Thursday's (Dec. 19) game against the Devils.",
        "The Sharks said on Wednesday (Dec. 18) that Vanecek is expected to be sidelined for 2-3 weeks due to an upper-body injury, per Sheng Peng of San Jose Hockey Now.",
        "Gustavsson is out for Friday's (Dec. 20) game against Utah.",
        "The Pittsburgh Penguins placed D Marcus Pettersson on injured reserve on Tuesday (Dec. 17).",
        "Lauko is week-to-week after aggravating his previous muscle issue, according to Michael Russo of The Athletic.",
        "Regula was never taken off season-opening injured reserve despite being waived by Boston and claimed by Edmonton on Wednesday (Dec. 11), per Daniel Nugent-Bowman of The Athletic.",
        "The Minnesota Wild placed F Yakov Trenin on injured reserve on Thursday (Dec. 19).",
        "Forsberg sustained an undisclosed injury on Saturday (Dec. 14) versus the Penguins and remains without a timeline for return, per Bruce Garrioch of Postmedia. ",
        "Moore did not play in Thursday's (Dec. 19) game against the Flyers.",
        "Kuzmenko did not play in Thursday's (Dec. 19) game against the Senators.",
        "The Lightning said that Moser is expected to miss 8-10 weeks with a lower body injury.",
        "The Blackhawks placed F Craig Smith on injured reserve on Friday (Dec. 20).",
        "The Sharks placed F Klim Kostin on injured reserve on Saturday (Dec. 14).",
        "The Maple Leafs said on Tuesday (Dec. 17) that Stolarz is expected to miss the next 4-6 weeks after undergoing a procedure to remove a loose body in his knee.",
        "The Minnesota Wild placed D Jake Middleton on injured reserve on Friday (Dec. 13).",
        "The Hurricanes said on Tuesday (Dec. 17) that Drury will miss a minimum of four weeks after undergoing hand surgery, per Chip Alexander of The Raleigh News & Observer.",
        "The Dallas Stars placed D Matt Dumba on injured reserve on Wednesday (Dec. 18).",
        "Miller did not travel with the Rangers and will miss Friday's (Dec. 20) tilt in Dallas, according to Mollie Walker of the New York Post.",
        "Danforth did not play in Thursday's (Dec. 19) game against the Devils.",
        "Gustafsson is battling an illness and is Questionable for Saturday's (Dec. 21) game against the Wild, per Jets beat writer Ken Wiebe.",
        "Josi did not play in Thursday's (Dec. 19) game versus the Penguins.",
        "The Utah Hockey Club said on Thursday (Dec. 12) that Bortuzzo did not travel with the team on their current trip and is out indefinitely.",
        "The Chicago Blackhawks placed D Alec Martinez on injured reserve on Friday (Dec. 13).",
        "The Philadelphia Flyers placed F Nicolas Deslauriers on injured reserve.",
        "The New York Islanders placed G Semyon Varlamov on long-term injured reserve on Thursday (Dec. 19).",
        "The Minnesota Wild placed F Joel Eriksson Ek on injured reserve on Friday (Dec. 6) and is considered week-to-week.",
        "The Ducks said Zegras had successful knee surgery on Thursday (Dec. 12) to repair a torn meniscus and is expected to miss six weeks.",
        "The Los Angeles Kings placed F Trevor Lewis on injured reserve on Wednesday (Dec. 4).",
        "Seguin will be out of action for 4-6 months when he undergoes surgery on Thursday (Dec. 5) for a left-side femoral acetabular impingement and hip labrum, per Lia Assimakopoulos of The Dallas Morning News.",
        "Chinakhov completed a solo skating session on Wednesday (Dec. 18) but is without a timeline to return, per Aaron Portzline of The Athletic.",
        "The Flames announced that Kirkland underwent successful ACL surgery on Wednesday (Dec. 4) and he will be out for the remainder of the season.",
        "Avalanche head coach Jared Bednar said on Monday (Dec. 2) that Kylington is considered week-to-week, per Bailey Curtis of The Hockey News.",
        "The Utah Hockey Club said on Saturday (Nov. 30) that Lamoureux was placed on injured reserve.",
        "Manson is out for Friday's (Dec. 20) game against Anaheim.",
        "The Vancouver Canucks placed D Filip Hronek on long-term injured reserve on Thursday (Dec. 5).",
        "The Colorado Avalanche placed F Miles Wood on long-term injured reserve on Saturday (Dec.7). He is considered month-to-month, per Evan Rawal of the Denver Gazette.",
        "The Ottawa Senators placed D Artem Zub on long-term injured reserve on Tuesday (Nov. 26).",
        "The Senators said on Tuesday (Dec. 3) that Perron is not expected to be back in the short term, per TSN 1200 Ottawa.",
        "The Colorado Avalanche placed F Jonathan Drouin on injured reserve on Saturday (Dec. 7).",
        "The Winnipeg Jets placed D Dylan Samberg on injured reserve on Sunday (Nov. 24).",
        "The Utah Hockey Club said on Monday (Dec. 16) that Ingram remains out indefinitely, per Belle Fraser of The Salt Lake Tribune.",
        "Hutton is skating on his own but is not ready to join the team yet, per Jesse Granger of The Athletic.",
        "The Capitals said on Friday (Dec. 20) that Ovechkin will not return before the Christmas break.",
        "Maple Leafs head coach Craig Berube announced on Thursday (Dec. 5) that Hakanpaa recently underwent a procedure on his knee that should allow him to resume skating soon, per David Alter of The Hockey News.",
        "Jones did not play in Thursday's (Dec. 19) game versus Kraken.",
        "The Seattle Kraken placed F Jordan Eberle on long-term injured reserve on Saturday (Nov. 30).",
        "Lindholm remains week-to-week, according to Conor Ryan of The Boston Globe. He is still on injured reserve and isn't close to being available to return.",
        "The Washington Capitals shifted F Sonny Milano to long-term injured reserve, Stephen Whyno of the Associated Press reports.",
        "The Flames announced that Mantha will require surgery on his ACL on Thursday (Nov. 14) and will miss the remainder of the 2024-25 season.",
        "The Islanders said that Reilly will have a procedure on his heart on Tuesday (Nov. 19). He will be out indefinitely.",
        "The Hurricanes announced that Andersen will undergo a procedure on his knee on Friday (Nov. 22 )which will knock him out of action about 8 weeks or so, per TSN and RDS Hockey Insider Pierre LeBrun.",
        "Leddy will accompany the Blues on the team's upcoming four-game road trip, per Lou Korac of NHL.com.",
        "The Blue Jackets announced that Gudbranson underwent successful shoulder surgery on Monday (Oct. 21) and is without a timetable to return.",
        "The Utah Hockey Club announced D Sean Durz has undergone successful shoulder surgery and is expected to return in 4-6 months.",
        "The Vegas Golden Knights placed F Jordan Gustafson on injured reserve non-roster list on Tuesday (Oct. 8).",
        "The Vegas Golden Knights placed F Jakub Demek on the injured reserve non-roster list on Tuesday (Oct. 8).",
        "The Vegas Golden Knights placed D Lukas Cormier on injured reserve non-roster list on Tuesday (Oct. 8).",
        "The Colorado Avalanche placed D Tucker Poolman on long-term injured reserve. He didn't play in 2023-24 due to migraines and won't be available for the 2024-25 campaign either.",
        "The Philadelphia Flyers placed D Ryan Ellis on injured reserve.",
        "The Columbus Blue Jackets placed F Jordan Dumais on injured reserve.",
        "Jenner has resumed skating on Tuesday (Dec. 10) and would miss 5-6 months, per Mark Scheig of The Hockey Writers.",
        "The Maple Leafs said Jarnkrok had surgery to repair a sports hernia and is now considered month-to-month.",
        "Grosenick underwent successful surgery on Wednesday (Oct. 2) to repair a torn ACL in his right knee and will not play this season. He is expected to make a full recovery and be ready for the start of the 2025-26 season.",
        "The Canadiens said that Reinbacher underwent surgery to his left knee on Tuesday (Oct. 1) and is out for 5-to-6 months.",
        "The Nashville Predators placed F Austin Roest on injured reserve non-roster list on Sunday (Sept. 29).",
        "The Devils said that Hatakka underwent successful shoulder surgery on Thursday (Oct. 10) and is without a timetable to return.",
        "Doughty is aiming to return to action in early January as long as there are no setbacks in his recovery, per Dennis Bernstein of The Fourth Period.",
        "The Utah Hockey Club said on Wednesday (Oct. 23) that Marino underwent successful surgery and is expected to return in 3-4 months.",
        "Vlasic is ramping up his condition, according to Sharks head coach Ryan Warsofsky. There is no clear timetable yet for his return.",
        "Couture has not resumed skating on Friday (Nov. 1) and remains without a timeline to return, per Sheng Peng of San Jose Hockey Now.",
        "The Capitals said on Wednesday (Sept. 18) that Oshie will be put on long-term injured reserve due to a chronic back injury which is expected to cost him the entire 2024-25 campaign, per Tom Gulitti of NHL.com.",
        "The Edmonton Oilers placed F Evander Kane on long-term injured reserve on Tuesday (Oct. 8).",
        "The St. Louis Blues placed D Torey Krug on long-term injured reserve on Tuesday (Oct. 8).",
        "The Carolina Hurricanes placed F Jesper Fast on long-term injured reserve on Wednesday (Oct. 9).",
        "Brossoit had another procedure done on Friday (Nov. 29) and is expected to be out for another six weeks, according to Blackhawks head coach Luke Richardson.",
        "The San Jose Sharks placed F Igor Chernyshov on injured reserve on Monday (Oct. 7).",
        "The Washington Capitals placed F Nicklas Backstrom on long-term injured reserve.",
        "Avalanche head coach Jared Bednar said that Landeskog remains without a timetable to return, per Adrian Hernandez of SBNation.com."
    ]
}