{
    "date": [
        "2025-05-23",
        "2025-05-22",
        "2025-05-22",
        "2025-05-20",
        "2025-05-19",
        "2025-05-17",
        "2025-05-15",
        "2025-05-10",
        "2025-05-02",
        "2025-05-01",
        "2025-04-29",
        "2025-04-23",
        "2025-04-23",
        "2025-04-23",
        "2025-04-21",
        "2025-04-21",
        "2025-04-20",
        "2025-04-16",
        "2025-04-16",
        "2025-04-13",
        "2025-04-13",
        "2025-04-13",
        "2025-04-13",
        "2025-04-12",
        "2025-04-11",
        "2025-04-10",
        "2025-04-10",
        "2025-04-09",
        "2025-04-05",
        "2025-04-04",
        "2025-04-03",
        "2025-04-01",
        "2025-04-01",
        "2025-03-29",
        "2025-03-27",
        "2025-03-27",
        "2025-03-25",
        "2025-03-23",
        "2025-03-22",
        "2025-03-22",
        "2025-03-14",
        "2025-03-14",
        "2025-03-13",
        "2025-03-13",
        "2025-03-09",
        "2025-03-09",
        "2025-03-06",
        "2025-03-02",
        "2025-03-01",
        "2025-02-27",
        "2025-02-25",
        "2025-02-25",
        "2025-02-22",
        "2025-02-19",
        "2025-02-18",
        "2025-02-18",
        "2025-02-07",
        "2025-02-01",
        "2025-02-01",
        "2025-01-29",
        "2024-12-31",
        "2024-12-28",
        "2024-12-14",
        "2024-12-05",
        "2024-11-29",
        "2024-11-16",
        "2024-11-12",
        "2024-11-08",
        "2024-11-05",
        "2024-10-08",
        "2024-10-07",
        "2024-10-02",
        "2024-09-18",
        "2024-09-03",
        "2024-08-29",
        "2024-08-28"
    ],
    "player": [
        "Roope Hintz",
        "Sam Reinhart",
        "Sean Walker",
        "Bo Horvat",
        "Nick Jensen",
        "Josh Morrissey",
        "Jalen Chatfield",
        "Calvin Pickard",
        "Sam Montembeault",
        "Johnathan Kovacevic",
        "Tyler Tucker",
        "John Beecher",
        "Pavel Zacha",
        "Dylan Guenther",
        "Chris Kreider",
        "Martin Fehervary",
        "Ross Colton",
        "Jared McCann",
        "Kris Letang",
        "Klim Kostin",
        "Oliver Bjorkstrand",
        "Braden Schneider",
        "Derek Forbort",
        "Owen Power",
        "Mattias Ekholm",
        "Noel Acciari",
        "Matt Nieto",
        "Mario Ferraro",
        "John Marino",
        "Nils Aman",
        "Anthony Duclair",
        "Shakir Mukhamadullin",
        "Elias Pettersson",
        "Colton Sissons",
        "Bokondji Imama",
        "Connor Zary",
        "Tanner Jeannot",
        "Jordan Greenway",
        "Jason Dickinson",
        "Mark Kastelic",
        "Josh Norris",
        "Ross Johnston",
        "Rasmus Ristolainen",
        "Arthur Kaliyev",
        "Tommy Novak",
        "Connor Ingram",
        "Carter Mazur",
        "Jack Hughes",
        "Pierre-Olivier Joseph",
        "Robby Fabbri",
        "Kirby Dach",
        "Roman Josi",
        "Andrew Copp",
        "Kevin Labanc",
        "Noah Juulsen",
        "Charlie McAvoy",
        "Adam Wilsby",
        "Adam Edstrom",
        "Mathew Barzal",
        "Nils Lundkvist",
        "Jeremy Lauzon",
        "Brock McGinn",
        "Alec Regula",
        "Semyon Varlamov",
        "Justin Kirkland",
        "Jani Hakanpaa",
        "Hampus Lindholm",
        "Sonny Milano",
        "Anthony Mantha",
        "Tucker Poolman",
        "Ryan Ellis",
        "Troy Grosenick",
        "T.J. Oshie",
        "Torey Krug",
        "Jesper Fast",
        "Laurent Brossoit"
    ],
    "team": [
        "Dallas Stars",
        "Florida Panthers",
        "Carolina Hurricanes",
        "New York Islanders",
        "Ottawa Senators",
        "Winnipeg Jets",
        "Carolina Hurricanes",
        "Edmonton Oilers",
        "Montreal Canadiens",
        "New Jersey Devils",
        "St. Louis Blues",
        "Boston Bruins",
        "Boston Bruins",
        "Utah Hockey Club",
        "New York Rangers",
        "Washington Capitals",
        "Colorado Avalanche",
        "Seattle Kraken",
        "Pittsburgh Penguins",
        "San Jose Sharks",
        "Tampa Bay Lightning",
        "New York Rangers",
        "Vancouver Canucks",
        "Buffalo Sabres",
        "Edmonton Oilers",
        "Pittsburgh Penguins",
        "Pittsburgh Penguins",
        "San Jose Sharks",
        "Utah Hockey Club",
        "Vancouver Canucks",
        "New York Islanders",
        "San Jose Sharks",
        "Vancouver Canucks",
        "Nashville Predators",
        "Pittsburgh Penguins",
        "Calgary Flames",
        "Los Angeles Kings",
        "Buffalo Sabres",
        "Chicago Blackhawks",
        "Boston Bruins",
        "Buffalo Sabres",
        "Anaheim Ducks",
        "Philadelphia Flyers",
        "New York Rangers",
        "Pittsburgh Penguins",
        "Utah Hockey Club",
        "Detroit Red Wings",
        "New Jersey Devils",
        "Pittsburgh Penguins",
        "Anaheim Ducks",
        "Montreal Canadiens",
        "Nashville Predators",
        "Detroit Red Wings",
        "Columbus Blue Jackets",
        "Vancouver Canucks",
        "Boston Bruins",
        "Nashville Predators",
        "New York Rangers",
        "New York Islanders",
        "Dallas Stars",
        "Nashville Predators",
        "Anaheim Ducks",
        "Edmonton Oilers",
        "New York Islanders",
        "Calgary Flames",
        "Toronto Maple Leafs",
        "Boston Bruins",
        "Washington Capitals",
        "Calgary Flames",
        "Colorado Avalanche",
        "Philadelphia Flyers",
        "Minnesota Wild",
        "Washington Capitals",
        "St. Louis Blues",
        "Carolina Hurricanes",
        "Chicago Blackhawks"
    ],
    "teamid": [
        25,
        13,
        12,
        2,
        9,
        52,
        12,
        22,
        8,
        1,
        19,
        6,
        6,
        59,
        3,
        15,
        21,
        55,
        5,
        28,
        14,
        3,
        23,
        7,
        22,
        5,
        5,
        28,
        59,
        23,
        2,
        28,
        23,
        18,
        5,
        20,
        26,
        7,
        16,
        6,
        7,
        24,
        4,
        3,
        5,
        59,
        17,
        1,
        5,
        24,
        8,
        18,
        17,
        29,
        23,
        6,
        18,
        3,
        2,
        25,
        18,
        24,
        22,
        2,
        20,
        10,
        6,
        15,
        20,
        21,
        4,
        30,
        15,
        19,
        12,
        16
    ],
    "type": [
        "Lower Leg",
        "Lower Body",
        "Undisclosed",
        "Lower-body",
        "Lower Body",
        "Knee",
        "Undisclosed",
        "Undisclosed",
        "Groin",
        "Knee",
        "Lower-body",
        "Undisclosed",
        "Undisclosed",
        "Undisclosed",
        "Hand",
        "Meniscus",
        "Lower Body",
        "Undisclosed",
        "Heart",
        "Lower Body",
        "Lower Body",
        "Upper Body",
        "Eye",
        "Lower-body",
        "Undisclosed",
        "Undisclosed",
        "Undisclosed",
        "Ankle",
        "Face",
        "Undisclosed",
        "Personal",
        "Upper-body",
        "Oblique",
        "Lower Body",
        "Biceps",
        "Knee",
        "Groin",
        "Lower Body",
        "Wrist",
        "Upper Body",
        "Undisclosed",
        "Upper body",
        "Triceps",
        "Upper body",
        "Lower Body",
        "Personal",
        "Upper Body",
        "Shoulder",
        "Upper Body",
        "Upper Body",
        "Lower Body",
        "Concussion",
        "Pectoral",
        "Upper Body",
        "Groin",
        "Shoulder",
        "Upper-body",
        "Lower Body",
        "Kneecap",
        "Upper Body",
        "Lower-body",
        "ACL",
        "Knee",
        "Lower-body",
        "Lower-body",
        "Knee",
        "Kneecap",
        "Upper-body",
        "Lower-Body",
        "Head",
        "Back",
        "Knee",
        "Back",
        "Ankle",
        "Neck",
        "Knee"
    ],
    "notes": [
        "Hintz suffered an apparent lower leg or ankle injury in Friday's (May 23) Game 2 versus the Oilers, per Sam Nestler of DLLS Stars.",
        "The Panthers reported that Reinhart will see doctors on Friday (May 23) and his status for Saturday's (May 24) Game 3 versus the Hurricanes will be updated, according to Florida head coach Paul Maurice.",
        "The Hurricanes announced that Walker is Questionable for Saturday's (May 24) Game 3 versus the Panthers, per Ryan Henkel of The Hockey News.",
        "The Islanders reported on Tuesday (May 20) that Horvat sustained a lower body injury at the World Championships playing for Hockey Canada. His timeline for recovery will be determined after he visits with team doctors.",
        "Jensen had a procedure in New York on Monday to address a lower-body injury, per Bruce Garrioch of Postmedia.",
        "Morrissey stated on Tuesday (May 20) that he will not require surgery for the injury he sustained in Saturday's (May 17) Game 6 against the Stars, per Mitchell Clinton of the Jets' official site.",
        "Chatfield did not play in Thursday's (May. 22) Game 2 clash versus the Panthers.",
        "Pickard won't be available for the start of the Western Conference Finals, per Ryan Rishaug of TSN.",
        "The Canadiens reported on Friday (May 2) that Montembeault missed the last two playoff games after sustaining a groin tear, per Eric Engels of Sportsnet.",
        "The Devils reported on Thursday (May 8) that Kovacevic underwent knee surgery and won't be ready for the start of training camp, per Amanda Stein of the Devils' official site.",
        "The Blues said on Tuesday (May 6) that Tucker would have been sidelined for the remainder of the postseason if the team had advanced in the first round, per Lou Korac of NHL.com",
        "The Bruins said on Wednesday (Apr. 23) that Beecher might undergo surgery over the offseason, per Scott McLaughlin of WEEI.",
        "The Bruins said on Wednesday (Apr. 23) that Zacha had a minor surgery to address an undisclosed injury, according to general manager Don Sweeney, per Scott McLaughlin of WEEI.",
        "Guenther will miss the upcoming 2025 IIHF World Championship, per Utah Hockey Club Insider Craig Morgan.",
        "Kreider ended the season dealing with a hand injury that may require offseason surgery, Peter Baugh of The Athletic.",
        "The Capitals said on Tuesday (Apr. 22) that Fehervary will miss the remainder of the playoffs after undergoing a successful procedure on his meniscus.",
        "The Avalanche reported on Tuesday (May 6) that Colton missed the last six games with a groin pull, per Evan Rawal of the Denver Gazette. It's not immediately clear if he would have been ready to play in the second round either.",
        "McCann announced on Wednesday (Apr. 16) that he will undergo surgery to address an undisclosed issue that he dealt with throughout the season, according to Curtis Crabtree of Fox 13 Seattle.",
        "The Penguins said on Wednesday (Apr. 16) that Letang had surgery to repair a small hole in his heart and will be out 4-6 weeks.",
        "Kostin did not play in Monday's (Apr. 14) game against the Canucks. It is unlikely he will return this season.",
        "Krug iis not expected to resume his playing career according to GM Doug Armstrong, as per Lou Korac of NHL.com on Tuesday.",
        "Schneider missed the final two games of the regular season after undergoing surgery to repair a torn labrum, according to Peter Baugh of The Athletic.",
        "The Canucks said on Tuesday (Apr. 22) that Forbort underwent minor surgery to repair a broken orbital bone and is doing well, per Rick Dhaliwal of CHEK. He should be ready for the 2025-26 campaign.",
        "Power said on Saturday (Apr. 19) that he will need two months to recover from his lower-body injury, but he will not need surgery, per Heather Engel of NHL.com.",
        "The Oilers announced on Friday (May 16) that Ekholm will not be in the lineup for Games 1 and 2 in the Western Conference Final, per Ryan Rishaug of TSN.",
        "The Penguins said on Thursday (Apr. 10) that Acciari will miss the remainder of the season.",
        "The Penguins said on Thursday (Apr. 10) that Nieto will miss the remainder of the season.",
        "The Sharks said on Friday (Apr. 11) that Ferraro's season-ending injury is a broken ankle that won't require surgery, according to Sheng Peng of San Jose Hockey Now.",
        "Marino didn't accompany Utah on the team's season-ending three-game road trip, Belle Fraser of The Salt Lake Tribune reports Saturday (Apr. 12).",
        "Aman will miss the final three games of the 2024-25 campaign.",
        "The Islanders announced on Thursday (Apr. 3) that Duclair stepped away from the team for personal reasons.",
        "Mukhamadullin underwent shoulder surgery last week, Max Miller of NHL.com reports Thursday (Apr. 17).",
        "The Canucks said on Tuesday (Apr. 8) that Pettersson is unlikely to return before the end of the regular season but hasn't given up hope of getting back into the lineup, according to Sportsnet's Elliotte Friedman.",
        "Sissons did not play in Wednesday's (Apr. 16) game versus the Stars.",
        "The Penguins announced that Imama underwent successful biceps surgery on Saturday (Mar. 29) and will be out 4-6 months.",
        "Zary is expected to miss Thursday's (Apr. 17) against the Kings with no clear timetable to return, per the NHL media site.",
        "The Kings reported on Monday (May 5) that Jeannot missed the final 12 games of the regular season and all six of the team's playoff outings due to a groin injury, per Zach Dooley of the Kings' official site.",
        "The Sabres said on Saturday (Apr. 12) that Greenway is not expected to return before the end of the regular season, per Lance Lysowski of The Buffalo News.",
        "Dickinson will miss the remainder of the 2024-25 campaign because of a wrist injury, according to Ben Pope of the Chicago Sun-Times.",
        "The Bruins said on Thursday (Apr. 10) that Kastelic wonâ\u0080\u0099t play before the end of the regular season.",
        "Norris' injury is a soft-tissue injury that the Sabres knew about before acquiring him from the Senators, according to Brian Koziol of WGR.",
        "The Ducks announced on Saturday (Mar. 29) that Johnston isn't expected to play again this season, according to Derek Lee of The Hockey News.",
        "The Flyers said on Thursday (Apr. 24) that Ristolainen underwent successful surgery on his right triceps tendon rupture and is expected to miss the next six months and training camp.",
        "The Rangers announced on Tuesday (Mar. 18) that Kaliyev will miss the remainder of the 2024-25 regular season and playoffs.",
        "The Penguins said on Thursday (Apr. 10) that Novak will miss the remainder of the season.",
        "The Utah Hockey Club announced on Sunday (Mar. 9) that Ingram is out indefinitely after entering the NHL/NHLPA Player Assistance Program.",
        "The Detroit Red Wings placed F Carter Mazur on injured reserve on Friday (Mar. 7).",
        "The New Jersey Devils placed F Jack Hughes on Long-term Injured Reserve on Wednesday (Mar. 5). He's expected to be ready for training camp.",
        "The Penguins announced that Joseph is still on injured reserve and OUT for Thursday's (Apr. 17) regular-season finale against the Capitals, per Seth Rorabaugh of Tribune-Review Sports.",
        "The Ducks announced on Saturday (Mar. 29) that Fabbri isn't expected to return before the end of the 2024-25 campaign, as per Derek Lee of The Hockey News.",
        "The Montreal Canadiens placed F Kirby Dach on the Injured Reserve on Sunday (Mar 2.) and is out for the season.",
        "Josi missed the last 25 games of the season due to a concussion, per Alex Daugherty of The Tennessean. But he is feeling good about where he's at in his recovery after finishing the 2024-25 season on injured reserve.",
        "The Red Wings said that Copp will miss the remainder of the 2024-25 campaign after undergoing surgery on Tuesday (Feb. 25) to repair a torn pectoral tendon.",
        "The Blue Jackets announced that Labanc was placed on injured reserve after undergoing shoulder surgery on Friday (Feb. 21) and will miss the rest of the season.",
        "Juulsen had a successful lower-body procedure on Friday (Feb. 28) and is expected to miss approximately 12 weeks, per Canucks' General Manager Patrik Allvin.",
        "The Bruins said on Thursday (Apr. 10) that McAvoy will not return this season, per Joe Haggerty of Boston Sports Journal.",
        "The Nashville Predators placed D Adam Wilsby on injured reserve on Friday (Feb. 21) and will miss the remainder of the season.",
        "The Rangers said on Monday (Apr. 21) that Edstrom has undergone surgery and should be fully healthy in time for training camp this spring, per Vince Z. Mercogliano of USA Today.",
        "The Islanders said on Saturday (Mar. 8) that Barzal remains on long-term injured reserve as he is not guaranteed to be back before the end of the regular season, per Andrew Gross of Newsday.",
        "The Dallas Stars placed D Nils Lundkvist on Long Term Injured Reserve on Saturday (Feb. 1).",
        "The Predators announced on Tuesday (Feb. 18) that Lauzon will miss 4-6 months with a lower-body injury.",
        "The Ducks announced on Tuesday (Jan. 21) that McGinn had surgery to reconstruct his ACL and will be sidelined for 7-9 months.",
        "Regula was never taken off the season-opening injured reserve despite being waived by Boston and claimed by Edmonton on Wednesday (Dec. 11), per Daniel Nugent-Bowman of The Athletic.",
        "Varlamov had a knee procedure in December and feels he will be ready for training camp in September, Arthur Staple of The Athletic reports Saturday (Apr. 19).",
        "The Flames announced that Kirkland underwent successful ACL surgery on Wednesday (Dec. 4) and he will be out for the remainder of the season.",
        "The Maple Leafs reported on Saturday (Feb. 1) that Hakanpaa won't participate in the upcoming 4 Nations Face-Off.",
        "The Bruins announced on Sunday (Feb. 23) that Lindholm underwent surgery for a fractured patella and is likely out for the season, per Conor Ryan of The Boston Globe.",
        "Capitals' general manager Chris Patrick said on Friday (Mar. 7) that Milano recently sustained a significant setback in his recovery, per Sammi Silber of The Hockey News.",
        "The Flames announced that Mantha will require surgery on his ACL on Thursday (Nov. 14) and will miss the remainder of the 2024-25 season.",
        "The Colorado Avalanche placed D Tucker Poolman on long-term injured reserve. He didn't play in 2023-24 due to migraines and won't be available for the 2024-25 campaign either.",
        "The Philadelphia Flyers placed D Ryan Ellis on long-term injured reserve on Monday (Oct. 7).",
        "Grosenick underwent successful surgery on Wednesday (Oct. 2) to repair a torn ACL in his right knee and will not play this season. He is expected to make a full recovery and be ready for the start of the 2025-26 season.",
        "The Capitals said on Wednesday (Sept. 18) that Oshie will be put on long-term injured reserve due to a chronic back injury which is expected to cost him the entire 2024-25 campaign, per Tom Gulitti of NHL.com.",
        "The St. Louis Blues reported on Tuesday (May 6) that Krug is not expected to resume his playing career according to general manager Doug Armstrong, per Lou Korac of NHL.com.",
        "The Hurricanes announced on Wednesday (Oct. 9) that Fast is out for the 2024-2025 season as he recovers from neck surgery.",
        "The Blackhawks said on Thursday (Mar. 6) that Brossoit is not expected to play this season, according to Ben Pope of the Chicago Sun-Times."
    ]
}