{
    "date": [
        "2024-09-18",
        "2024-09-18",
        "2024-09-18",
        "2024-09-18",
        "2024-09-18",
        "2024-09-18",
        "2024-09-18",
        "2024-09-17",
        "2024-09-17",
        "2024-09-13",
        "2024-09-12",
        "2024-09-12",
        "2024-09-12",
        "2024-09-03",
        "2024-08-29",
        "2024-08-28",
        "2024-07-25",
        "2024-05-13"
    ],
    "player": [
        "Rasmus Dahlin",
        "Evander Kane",
        "Luke Glendening",
        "Michael Eyssimont",
        "Erik Karlsson",
        "T.J. Oshie",
        "Jason Robertson",
        "Ilya Sorokin",
        "Dakota Joshua",
        "Artturi Lehkonen",
        "Quentin Miller",
        "Luke Hughes",
        "Josh Filmon",
        "Torey Krug",
        "Jesper Fast",
        "Laurent Brossoit",
        "Rafael Harvey-Pinard",
        "Valeri Nichushkin"
    ],
    "team": [
        "Buffalo Sabres",
        "Edmonton Oilers",
        "Tampa Bay Lightning",
        "Tampa Bay Lightning",
        "Pittsburgh Penguins",
        "Washington Capitals",
        "Dallas Stars",
        "New York Islanders",
        "Vancouver Canucks",
        "Colorado Avalanche",
        "Montreal Canadiens",
        "New Jersey Devils",
        "New Jersey Devils",
        "St. Louis Blues",
        "Carolina Hurricanes",
        "Chicago Blackhawks",
        "Montreal Canadiens",
        "Colorado Avalanche"
    ],
    "teamid": [
        7,
        22,
        14,
        14,
        5,
        15,
        25,
        2,
        23,
        21,
        8,
        1,
        1,
        19,
        12,
        16,
        8,
        21
    ],
    "type": [
        "Undisclosed",
        "Undisclosed",
        "Undisclosed",
        "Lower body",
        "Upper body",
        "Back",
        "Foot",
        "Back",
        "Cancer",
        "Shoulder",
        "Shoulder",
        "Shoulder",
        "Upper-body",
        "Ankle",
        "Neck",
        "Meniscus",
        "Leg",
        "NHLPA"
    ],
    "notes": [
        "Dahlin left Wednesday's practice before its conclusion due to an undisclosed injury, per Lance Lysowski of The Buffalo News.",
        "The Edmonton Oilers' GM Stan Bowman confirms that Evander Kane will have surgery and will not be ready for the start of the season.",
        "Glendening could return by the Oct. 11 opener, Tampa Bay Lightning GM Julien BriseBois said.",
        "General Manager Julien BriseBois said Mikey Eyssimont has a lower-body injury and the hope is that he can return to practicing on a regular basis by the end of camp, with an eye toward a mid-October return.",
        "D Erik Karlsson is day-to-day with an upper-body injury per Pens Inside Scoop.",
        "Oshie will be put on long-term injured reserve due to a chronic back injury that's expected to cost him the entire 2024-25 campaign, per Tom Gulitti of NHL.com.",
        "Jason Robertson had surgery on his foot on July 31. Heâ\u0080\u0099s been non-weight bearing the last six weeks. He wonâ\u0080\u0099t be skating to start training camp with the main team. Heâ\u0080\u0099ll miss majority of camp, Jim Nill says.",
        "Sorokin had surgery to address a back injury this offseason but is not expected to miss any regular-season action, Stefen Rosner of NHL.com reports.",
        "Joshua announced that he underwent surgery for testicular cancer and will not be ready to join the team for training camp.",
        "Lehkonen will not be able to participate fully at the start of training camp, John Matisz of The Score reports.",
        "Miller will be undergoing surgery to repair damage to his right shoulder, per Jonathan Larivee of Hockey Feed.",
        "The New Jersey Devils announced that D Luke Hughes suffered a left shoulder injury earlier this month during off-season training. Hughesâ\u0080\u0099 recovery time is approximately six-eight weeks.",
        "Filmon will not participate in the team's Prospects Challenge due to an upper-body injury and is considered week-to-week.",
        "Krug will undergo surgery on his left ankle and will miss the entire 2024-25 season.",
        "Jesper Fast has undergone neck surgery, and is not expected to play in the upcoming season. per Carolina Hurricanes.",
        "Brossoit underwent meniscus repair surgery yesterday, out 5-7 weeks, which puts him back late end of training camp or beginning of regular season, per Frank Seravalli of Daily Faceoff.",
        "Harvey-Pinard underwent successful surgery on Thursday after suffering a broken leg. The recovery period for the 25-year-old winger is estimated to be four months.",
        "Nichushkin was placed in Stage 3 of the NHL/NHLPA player assistance program and suspended for a minimum of six months without pay for violating the terms of Stage 2, the NHL and NHLPA announced."
    ]
}