{
    "date": [
        "2024-10-07",
        "2024-10-07",
        "2024-10-07",
        "2024-10-07",
        "2024-10-07",
        "2024-10-07",
        "2024-10-07",
        "2024-10-07",
        "2024-10-07",
        "2024-10-07",
        "2024-10-07",
        "2024-10-07",
        "2024-10-07",
        "2024-10-07",
        "2024-10-07",
        "2024-10-07",
        "2024-10-07",
        "2024-10-07",
        "2024-10-06",
        "2024-10-05",
        "2024-10-05",
        "2024-10-05",
        "2024-10-05",
        "2024-10-04",
        "2024-10-04",
        "2024-10-04",
        "2024-10-04",
        "2024-10-04",
        "2024-10-04",
        "2024-10-04",
        "2024-10-04",
        "2024-10-04",
        "2024-10-04",
        "2024-10-04",
        "2024-10-04",
        "2024-10-03",
        "2024-10-03",
        "2024-10-03",
        "2024-10-02",
        "2024-10-02",
        "2024-10-02",
        "2024-10-02",
        "2024-10-02",
        "2024-10-01",
        "2024-10-01",
        "2024-10-01",
        "2024-10-01",
        "2024-10-01",
        "2024-09-30",
        "2024-09-28",
        "2024-09-27",
        "2024-09-27",
        "2024-09-27",
        "2024-09-26",
        "2024-09-26",
        "2024-09-26",
        "2024-09-26",
        "2024-09-24",
        "2024-09-24",
        "2024-09-24",
        "2024-09-24",
        "2024-09-20",
        "2024-09-20",
        "2024-09-20",
        "2024-09-19",
        "2024-09-19",
        "2024-09-19",
        "2024-09-19",
        "2024-09-19",
        "2024-09-19",
        "2024-09-19",
        "2024-09-19",
        "2024-09-19",
        "2024-09-19",
        "2024-09-19",
        "2024-09-18",
        "2024-09-18",
        "2024-09-18",
        "2024-09-18",
        "2024-09-18",
        "2024-09-18",
        "2024-09-18",
        "2024-09-17",
        "2024-09-17",
        "2024-09-13",
        "2024-09-12",
        "2024-09-12",
        "2024-09-12",
        "2024-09-03",
        "2024-08-29",
        "2024-08-28",
        "2024-08-21",
        "2024-07-25",
        "2024-05-13"
    ],
    "player": [
        "Max McCue",
        "Fraser Minten",
        "Spencer Stastney",
        "Lucas Carlsson",
        "Graeme Clarke",
        "Simon Robertsson",
        "Connor Dewar",
        "Mavrik Bourque",
        "Jimmy Vesey",
        "Jordan Dumais",
        "Justin Danforth",
        "Jani Hakanpaa",
        "Dakota Mermis",
        "Joakim Ryan",
        "Matthew Highmore",
        "Ian Mitchell",
        "Yegor Sharangovich",
        "Alec Regula",
        "Boone Jenner",
        "Nicolas Aube-Kubel",
        "JJ Peterka",
        "Zach Benson",
        "Ondrej Palat",
        "William Karlsson",
        "Derek Ryan",
        "Matthew Poitras",
        "Matt Boldy",
        "Bryan Rust",
        "Justin Sourdif",
        "Wyatt Kaiser",
        "Jake McCabe",
        "Nicholas Robertson",
        "Jack Campbell",
        "Calle Jarnkrok",
        "Jake Middleton",
        "Jaret Anderson-Dolan",
        "Dmitri Voronkov",
        "Gavin Brindley",
        "Blake Lizotte",
        "Mackie Samoskevich",
        "Troy Grosenick",
        "Jared McCann",
        "Pius Suter",
        "Macklin Celebrini",
        "Patrik Laine",
        "David Reinbacher",
        "Brad Marchand",
        "Vasily Ponomarev",
        "Alex Nedeljkovic",
        "Brandon Saad",
        "John Gibson",
        "Santeri Hatakka",
        "Justin Poirier",
        "Logan Stanley",
        "Jake Bean",
        "Martin Pospisil",
        "Drew Doughty",
        "Thomas Bordeleau",
        "Artemi Panarin",
        "Tomas Nosek",
        "Ryan Lindgren",
        "Ville Heinola",
        "Artyom Levshunov",
        "Teddy Blueger",
        "Oskar Sundqvist",
        "Pavel Mintyukov",
        "Nick Bjugstad",
        "Thatcher Demko",
        "Brett Pesce",
        "John Marino",
        "Marc-Edouard Vlasic",
        "Shakir Mukhamadullin",
        "Logan Couture",
        "Kevin Bahl",
        "Kaiden Guhle",
        "T.J. Oshie",
        "Matt Nieto",
        "Evander Kane",
        "Michael Eyssimont",
        "Luke Glendening",
        "Jason Robertson",
        "Erik Karlsson",
        "Dakota Joshua",
        "Ilya Sorokin",
        "Artturi Lehkonen",
        "Quentin Miller",
        "Josh Filmon",
        "Luke Hughes",
        "Torey Krug",
        "Jesper Fast",
        "Laurent Brossoit",
        "Igor Chernyshov",
        "Rafael Harvey-Pinard",
        "Valeri Nichushkin"
    ],
    "team": [
        "Columbus Blue Jackets",
        "Toronto Maple Leafs",
        "Nashville Predators",
        "San Jose Sharks",
        "Minnesota Wild",
        "St. Louis Blues",
        "Toronto Maple Leafs",
        "Dallas Stars",
        "New York Rangers",
        "Columbus Blue Jackets",
        "Columbus Blue Jackets",
        "Toronto Maple Leafs",
        "Toronto Maple Leafs",
        "Carolina Hurricanes",
        "Ottawa Senators",
        "Boston Bruins",
        "Calgary Flames",
        "Boston Bruins",
        "Columbus Blue Jackets",
        "Buffalo Sabres",
        "Buffalo Sabres",
        "Buffalo Sabres",
        "New Jersey Devils",
        "Vegas Golden Knights",
        "Edmonton Oilers",
        "Boston Bruins",
        "Minnesota Wild",
        "Pittsburgh Penguins",
        "Florida Panthers",
        "Chicago Blackhawks",
        "Toronto Maple Leafs",
        "Toronto Maple Leafs",
        "Detroit Red Wings",
        "Toronto Maple Leafs",
        "Minnesota Wild",
        "Winnipeg Jets",
        "Columbus Blue Jackets",
        "Columbus Blue Jackets",
        "Pittsburgh Penguins",
        "Florida Panthers",
        "Minnesota Wild",
        "Seattle Kraken",
        "Vancouver Canucks",
        "San Jose Sharks",
        "Montreal Canadiens",
        "Montreal Canadiens",
        "Boston Bruins",
        "Pittsburgh Penguins",
        "Pittsburgh Penguins",
        "St. Louis Blues",
        "Anaheim Ducks",
        "New Jersey Devils",
        "Carolina Hurricanes",
        "Winnipeg Jets",
        "Calgary Flames",
        "Calgary Flames",
        "Los Angeles Kings",
        "San Jose Sharks",
        "New York Rangers",
        "Florida Panthers",
        "New York Rangers",
        "Winnipeg Jets",
        "Chicago Blackhawks",
        "Vancouver Canucks",
        "St. Louis Blues",
        "Anaheim Ducks",
        "Utah Hockey Club",
        "Vancouver Canucks",
        "New Jersey Devils",
        "Utah Hockey Club",
        "San Jose Sharks",
        "San Jose Sharks",
        "San Jose Sharks",
        "Calgary Flames",
        "Montreal Canadiens",
        "Washington Capitals",
        "Pittsburgh Penguins",
        "Edmonton Oilers",
        "Tampa Bay Lightning",
        "Tampa Bay Lightning",
        "Dallas Stars",
        "Pittsburgh Penguins",
        "Vancouver Canucks",
        "New York Islanders",
        "Colorado Avalanche",
        "Montreal Canadiens",
        "New Jersey Devils",
        "New Jersey Devils",
        "St. Louis Blues",
        "Carolina Hurricanes",
        "Chicago Blackhawks",
        "San Jose Sharks",
        "Montreal Canadiens",
        "Colorado Avalanche"
    ],
    "teamid": [
        29,
        10,
        18,
        28,
        30,
        19,
        10,
        25,
        3,
        29,
        29,
        10,
        10,
        12,
        9,
        6,
        20,
        6,
        29,
        7,
        7,
        7,
        1,
        54,
        22,
        6,
        30,
        5,
        13,
        16,
        10,
        10,
        17,
        10,
        30,
        52,
        29,
        29,
        5,
        13,
        30,
        55,
        23,
        28,
        8,
        8,
        6,
        5,
        5,
        19,
        24,
        1,
        12,
        52,
        20,
        20,
        26,
        28,
        3,
        13,
        3,
        52,
        16,
        23,
        19,
        24,
        59,
        23,
        1,
        59,
        28,
        28,
        28,
        20,
        8,
        15,
        5,
        22,
        14,
        14,
        25,
        5,
        23,
        2,
        21,
        8,
        1,
        1,
        19,
        12,
        16,
        28,
        8,
        21
    ],
    "type": [
        "Undisclosed",
        "Ankle",
        "Personal",
        "Undisclosed",
        "Lower Body",
        "Upper Body",
        "Shoulder",
        "Undisclosed",
        "Lower Body",
        "Lower Body",
        "Wrist",
        "Knee",
        "Upper Body",
        "Undisclosed",
        "Upper Body",
        "Undisclosed",
        "Lower Body",
        "Knee",
        "Undisclosed",
        "Lower-body",
        "Concussion",
        "Undisclosed",
        "Personal",
        "Undisclosed",
        "Undisclosed",
        "Undisclosed",
        "Lower-body",
        "Lower-body",
        "Undisclosed",
        "Illness",
        "Upper-body",
        "Upper-body",
        "NHL/NHLPA Player Assistance Program",
        "Lower-body",
        "Upper body",
        "Undisclosed",
        "Upper body",
        "Finger",
        "Concussion",
        "Upper-body",
        "Knee",
        "Lower-body",
        "Upper-body",
        "Lower-body",
        "Knee",
        "Knee",
        "Illness",
        "Upper-body",
        "Lower body",
        "Personal",
        "Appendix",
        "Undisclosed",
        "Undisclosed",
        "Knee",
        "Lower-body",
        "Lower-body",
        "Ankle",
        "Lower-body",
        "Lower-body",
        "Upper-body",
        "Upper-body",
        "Ankle",
        "Foot",
        "Lower Body",
        "Knee",
        "Lower body",
        "Upper-body",
        "Knee",
        "Lower Leg",
        "Upper-body",
        "Upper-body",
        "Lower body",
        "Groin",
        "Lower body",
        "Abdomen",
        "Back",
        "Knee",
        "Abdomen",
        "Lower body",
        "Undisclosed",
        "Foot",
        "Lower-body",
        "Cancer",
        "Back",
        "Shoulder",
        "Shoulder",
        "Upper-body",
        "Shoulder",
        "Ankle",
        "Neck",
        "Meniscus",
        "Shoulder",
        "Leg",
        "NHLPA"
    ],
    "notes": [
        "The Columbus Blue Jackets placed F Max McCue on the Injured Reserve.",
        "The Toronto Maple Leafs placed F Fraser Minten on the Injured Reserve.",
        "The Nashville Predators placed D Spencer Stastney on the Injured Reserve.",
        "The San Jose Sharks placed D Lucas Carlsson on Injured Reserved.",
        "Clarke is expected to miss about a month with a lower-body injury, Dylan Loucks of The Hockey News reports Saturday.",
        "The St. Louis Blues placed F Simon Robertsson on the Injured Reserve.",
        "The Toronto maple Leafs placed F Connor Dewar on the Injured Reserve.",
        "The Dallas Stars placed F Mavrik Bourque on the Injured reserve.",
        "The New York Rangers placed F Jimmy Vesey (lower body) on the Injured Reserve .",
        "The Columbus Blue jackets placed F Jordan Dumais on the Injured Reserve.",
        "The Columbus Blue Jackets placed F Justin Danforth on the Injured Reserve.",
        "The Toronto Maple Leafs placed D Jani Hakanpaa on the Injured Reserve.",
        "The Toronto Maple Leafs placed D Dakota Mermis (UpperBody) on the Long Term Injured Reserve.",
        "The Carolina Hurricanes placed D Joakim Ryan on the Injured Reserve.",
        "The Ottawa Senators placed F Matthew Highmore (Upper-Body) on the Injured Reserve.",
        "The Boston Bruins placed D Ian Mitchell on the Injured Reserve.",
        "The Calgary Flames placed F Yegor Sharangovich (lower body) on the Injured Reserve.",
        "The Boston Bruins placed D Alec Regula on the Injured Reserve.",
        "Jenner (undisclosed) will start the 2024-25 season on injured reserve.",
        "Aube-Kubel did not play in Saturday's (Oct. 5) game versus New Jersey.",
        "Peterka left Buffalo's Global Series game in Prague after just 1:39 TOI in the first due to an injury and has been diagnosed with a concussion post-game.",
        "Benson did not play in Saturday's (Oct. 5) game versus New Jersey.",
        "Palat did not play in Saturday's (Oct. 5) game versus Buffalo.",
        "Karlsson won't play in Saturday's preseason game against the Sharks, Jesse Granger of The Athletic reports.",
        "Ryan was late to practice on Friday and only participated in a few drills after it was announced that he was day-to-day with an undisclosed injury.",
        "Poitras (undisclosed) won't play Tuesday on Opening Night versus Florida.",
        "Boldy won't play in Friday's preseason game but is expected to be ready for the season opener. ",
        "The Pittsburgh Penguins placed F Bryan Rust (Lower-Body) on the Injured Reserve.",
        "The Florida Panthers placed F Justin Sourdif on Injured Reserve.",
        "The Chicago Blackhawks placed Kaiser on injured reserve.",
        "McCabe is considered day-to-day with an upper-body injury, per Daily Faceoff - Fantasy.",
        "Robertson is day-to-day with an upper-body injury, per Daily-Faceoff Fantasy.",
        "Campbell will be away from the Red Wings for an indefinite period of time after it was announced Friday that he has entered the NHL/NHLPA Player Assistance Program.",
        "The Toronto Maple Leafs placed F Calle Jarnkrok on the Injured Reserve.",
        "Middleton won't play in Friday's preseason game but is expected to be ready for the season opener.",
        "Anderson-Dolan is dealing with an undisclosed injury after blocking a shot against Calgary on Wednesday, Scott Billeck of the Winnipeg Sun reports.",
        "The Columbus Blue Jackets placed Voronkov on injured reserve.",
        "Brindley has been placed on injured reserve and is expected to miss 4 to 6 weeks.",
        "The Pittsburgh Penguins placed F Blake Lizotte (Concussion) on the Injured Reserve.",
        "Samoskevich is hoping to suit up for Saturday's preseason game against the Kings, Jameson Olive of the Panthers' official site reports.",
        "Grosenick underwent successful surgery to repair a torn anterior cruciate ligament in his right knee and will not play this season. He is expected to make a full recovery and be ready for the start of the 2025-26 season.",
        "McCann didn't play in Wednesday's (Oct. 2) game versus the Oilers.",
        "Suter is day-to-day with an upper-body injury, per Daily Faceoff - Fantasy.",
        "Celebrini left Tuesday's (Oct. 1) game with a lower body injury after crashing into the boards in the second period.",
        "Laine will not need surgery on his knee but will be sidelined for 2-to-3 months, per Daily Faceoff - Fantasy. ",
        "Reinbacher underwent surgery to his left knee this morning and is out 5-to-6 months.",
        "Marchand is questionable to return to Tuesday's preseason game versus the Flyers.",
        "Ponomarev is being evaluated for an upper-body injury, per head coach Mike Sullivan.",
        "The Pittsburgh Penguins placed G Alex Nedeljkovic (Lower-Body) on the Injured Reserve.",
        "The St. Louis Blues placed F Brandon Saad on the Injured Reserve.",
        "The Anaheim Ducks placed G John Gibson on the Injured Reserve.",
        "Hatakka is dealing with an injury that is considered more significant than day-to-day, Amanda Stein of the Devils' official site reports.",
        "Poirier will not be an option for Carolina in Friday's preseason contest against Florida, according to Walt Ruff of the Hurricanes' official site.",
        "The Winnipeg Jets placed D Logan Stanley (Knee) on the Injured Reserve.",
        "Bean isn't practicing on Saturday (Sept. 28), Wes Gilbertson of the Calgary Sun reports.",
        "Pospisil missed a third straight day of practice on Saturday, per Wes Gilbertson of the Calgary Sun.",
        "The Los Angeles Kings placed D Drew Doughty on the Injured Reserve.",
        "The San Jose Sharks placed F Igor Chernyshov on Injured Reserved.",
        "Panarin is day-to-day and will not practice on Thursday (Oct. 3).",
        "The Florida Panthers placed F Tomas Nosek on Injured Reserve.",
        "The New York Rangers placed D Ryan Lindgren (upper body) on the Injured Reserve.",
        "The Winnipeg Jets placed D Ville Heinola on the Injured Reserve.",
        "D Artyom Levshunov is not expected to play in any preseason games. As per Scott Powers of The Athletic.",
        "F Teddy Blueger won't return versus the Flames on Saturday, Brendan Batchelor of Sportsnet 650 reports.",
        "The St. Louis Blues placed F Oskar Sundqvist on the Injured Reserve.",
        "Mintyukov won't play Tuesday in a preseason game versus the Sharks, Derek Lee of The Hockey News reports.",
        "Bjugstad will be listed as week-to-week and is not taking part in the start of training camp, per Craig Morgan of ALLCITY Network.",
        "The Vancouver Canucks placed G Thatcher Demko on the Injured Reserve.",
        "Pesce didn't travel with the Devils to Czechia on Sunday, Amanda Stein of the Devils' official site reports, indicating he will miss the start of the 2024-25 season.",
        "Marino is considered week-to-week with an upper-body injury and will not be on the ice Thursday for the start of training camp, according to Craig Morgan of ALLCITY Network.",
        "The San Jose Sharks placed D Marc-Edouard Vlasic on Injured Reserved.",
        "The San Jose Sharks placed D Shakir Mukhamadullin on Injured Reserved.",
        "The San Jose Sharks placed F Logan Couture on Injured Reserve.",
        "Bahl skated with the team on Friday (Sept. 27) for the first time since training camp began last week, according to Pat Steinberg of Sportsnet 960 The Fan.",
        "Guhle sported a standard practice jersey on Wednesday (Oct. 2) as he continues to recover from an appendectomy.",
        "Oshie will be put on long-term injured reserve due to a chronic back injury that's expected to cost him the entire 2024-25 campaign, per Tom Gulitti of NHL.com.",
        "The Pittsburgh Penguins placed F Matt Nieto (Knee) on the Long-Term Injured Reserve.",
        "Kaneâ\u0080\u0099s recovery from abdominal surgery is expected to take a minimum of five months. They suggest it could be six months â\u0080\u0094 or longer, per Daniel Nugent-Bowman of The Athletic. ",
        "Eyssimont was originally expected to be out until the middle of October, but he removed his non-contact jersey for Thursday's practice.",
        "Glendening could return by the Oct. 11 opener, Tampa Bay Lightning GM Julien BriseBois said.",
        "Jason Robertson participated in Saturday's practice. Coach Alain Nasreddine remains optimistic about his readiness for the season opener, per NHL TV Analyst Brent Severyn. ",
        "Karlsson expects to be ready for Pittsburgh's season opener, per Daily Faceoff - Fantasy.",
        "The Vancouver Canucks placed F Dakota Joshua on the Injured Reserve.",
        "Coach Patrick Roy said Thursday that he is taking it one day at a time with Sorokin, Andrew Gross of Newsday reports.",
        "The Colorado Avalanche placed F Artturi Lehkonen on the Injured Reserve.",
        "Miller will be undergoing surgery to repair damage to his right shoulder, per Jonathan Larivee of Hockey Feed.",
        "Filmon will not participate in the team's Prospects Challenge due to an upper-body injury and is considered week-to-week.",
        "Hughes has yet to resume skating and remains 5-to-7 weeks away from returning to the Devils' lineup, per Daily Faceoff-Fantasy.",
        "Krug will undergo surgery on his left ankle and will miss the entire 2024-25 season.",
        "The carolina Hurricanes placed D Riley Stillman on the Injured Reserve.",
        "Brossoit underwent meniscus repair surgery yesterday, out 5-7 weeks, which puts him back late end of training camp or beginning of regular season, per Frank Seravalli of Daily Faceoff.",
        "The San Jose Sharks placed F Igor Chernyshov on Injured Reserved.",
        "Harvey-Pinard underwent successful surgery on Thursday after suffering a broken leg. The recovery period for the 25-year-old winger is estimated to be four months.",
        "Nichushkin was placed in Stage 3 of the NHL/NHLPA player assistance program and suspended for a minimum of six months without pay for violating the terms of Stage 2, the NHL and NHLPA announced."
    ]
}