{
    "date": [
        "2025-06-06",
        "2025-05-28",
        "2025-05-27",
        "2025-05-17",
        "2025-05-01",
        "2025-04-23",
        "2025-04-23",
        "2025-04-23",
        "2025-04-21",
        "2025-04-21",
        "2025-04-13",
        "2025-04-13",
        "2025-04-13",
        "2025-04-10",
        "2025-04-10",
        "2025-04-09",
        "2025-04-05",
        "2025-04-04",
        "2025-04-03",
        "2025-04-01",
        "2025-04-01",
        "2025-03-27",
        "2025-03-22",
        "2025-03-22",
        "2025-03-14",
        "2025-03-14",
        "2025-03-13",
        "2025-03-13",
        "2025-03-09",
        "2025-03-09",
        "2025-03-02",
        "2025-02-27",
        "2025-02-25",
        "2025-02-25",
        "2025-02-22",
        "2025-02-19",
        "2025-02-18",
        "2025-02-18",
        "2025-02-07",
        "2025-02-01",
        "2025-02-01",
        "2024-12-31",
        "2024-12-28",
        "2024-12-14",
        "2024-12-05",
        "2024-11-29",
        "2024-11-16",
        "2024-11-12",
        "2024-11-08",
        "2024-11-05",
        "2024-10-08",
        "2024-10-07",
        "2024-10-02",
        "2024-09-03",
        "2024-08-28"
    ],
    "player": [
        "Logan O'Connor",
        "Adam Lowry",
        "Zach Hyman",
        "Josh Morrissey",
        "Johnathan Kovacevic",
        "Pavel Zacha",
        "Dylan Guenther",
        "John Beecher",
        "Martin Fehervary",
        "Chris Kreider",
        "Klim Kostin",
        "Braden Schneider",
        "Oliver Bjorkstrand",
        "Matt Nieto",
        "Noel Acciari",
        "Mario Ferraro",
        "John Marino",
        "Nils Aman",
        "Anthony Duclair",
        "Elias Pettersson",
        "Shakir Mukhamadullin",
        "Bokondji Imama",
        "Jason Dickinson",
        "Mark Kastelic",
        "Josh Norris",
        "Ross Johnston",
        "Rasmus Ristolainen",
        "Arthur Kaliyev",
        "Connor Ingram",
        "Tommy Novak",
        "Jack Hughes",
        "Robby Fabbri",
        "Kirby Dach",
        "Roman Josi",
        "Andrew Copp",
        "Kevin Labanc",
        "Noah Juulsen",
        "Charlie McAvoy",
        "Adam Wilsby",
        "Adam Edstrom",
        "Mathew Barzal",
        "Jeremy Lauzon",
        "Brock McGinn",
        "Alec Regula",
        "Semyon Varlamov",
        "Justin Kirkland",
        "Jani Hakanpaa",
        "Hampus Lindholm",
        "Sonny Milano",
        "Anthony Mantha",
        "Tucker Poolman",
        "Ryan Ellis",
        "Troy Grosenick",
        "Torey Krug",
        "Laurent Brossoit"
    ],
    "team": [
        "Colorado Avalanche",
        "Winnipeg Jets",
        "Edmonton Oilers",
        "Winnipeg Jets",
        "New Jersey Devils",
        "Boston Bruins",
        "Utah Hockey Club",
        "Boston Bruins",
        "Washington Capitals",
        "New York Rangers",
        "San Jose Sharks",
        "New York Rangers",
        "Tampa Bay Lightning",
        "Pittsburgh Penguins",
        "Pittsburgh Penguins",
        "San Jose Sharks",
        "Utah Hockey Club",
        "Vancouver Canucks",
        "New York Islanders",
        "Vancouver Canucks",
        "San Jose Sharks",
        "Pittsburgh Penguins",
        "Chicago Blackhawks",
        "Boston Bruins",
        "Buffalo Sabres",
        "Anaheim Ducks",
        "Philadelphia Flyers",
        "New York Rangers",
        "Utah Hockey Club",
        "Pittsburgh Penguins",
        "New Jersey Devils",
        "Anaheim Ducks",
        "Montreal Canadiens",
        "Nashville Predators",
        "Detroit Red Wings",
        "Columbus Blue Jackets",
        "Vancouver Canucks",
        "Boston Bruins",
        "Nashville Predators",
        "New York Rangers",
        "New York Islanders",
        "Nashville Predators",
        "Anaheim Ducks",
        "Edmonton Oilers",
        "New York Islanders",
        "Calgary Flames",
        "Toronto Maple Leafs",
        "Boston Bruins",
        "Washington Capitals",
        "Calgary Flames",
        "Colorado Avalanche",
        "Philadelphia Flyers",
        "Minnesota Wild",
        "St. Louis Blues",
        "Chicago Blackhawks"
    ],
    "teamid": [
        21,
        52,
        22,
        52,
        1,
        6,
        59,
        6,
        15,
        3,
        28,
        3,
        14,
        5,
        5,
        28,
        59,
        23,
        2,
        23,
        28,
        5,
        16,
        6,
        7,
        24,
        4,
        3,
        59,
        5,
        1,
        24,
        8,
        18,
        17,
        29,
        23,
        6,
        18,
        3,
        2,
        18,
        24,
        22,
        2,
        20,
        10,
        6,
        15,
        20,
        21,
        4,
        30,
        19,
        16
    ],
    "type": [
        "Hip",
        "Hip",
        "Upper Body",
        "Knee",
        "Knee",
        "Undisclosed",
        "Undisclosed",
        "Undisclosed",
        "Meniscus",
        "Hand",
        "Lower Body",
        "Upper Body",
        "Lower Body",
        "Undisclosed",
        "Undisclosed",
        "Ankle",
        "Face",
        "Undisclosed",
        "Personal",
        "Oblique",
        "Upper-body",
        "Biceps",
        "Wrist",
        "Upper Body",
        "Undisclosed",
        "Upper body",
        "Triceps",
        "Upper body",
        "Personal",
        "Lower Body",
        "Shoulder",
        "Upper Body",
        "Lower Body",
        "Concussion",
        "Pectoral",
        "Upper Body",
        "Groin",
        "Shoulder",
        "Upper-body",
        "Lower Body",
        "Kneecap",
        "Lower-body",
        "ACL",
        "Knee",
        "Lower-body",
        "Lower-body",
        "Knee",
        "Kneecap",
        "Upper-body",
        "Lower-Body",
        "Head",
        "Back",
        "Knee",
        "Ankle",
        "Knee"
    ],
    "notes": [
        "The Avalanche announced on Friday (Jun. 6) that O'Connor underwent hip surgery and is expected to miss the next 5 to 6 months.",
        "The Jets reported that Lowry underwent successful hip surgery on Tuesday (May 27) and is expected to miss the next 5 to 6 months.",
        "Hyman said on Wednesday (Jun. 4) that he isn't sure whether he'll be ready for training camp, as per Jason Gregor of Sports 1440 Edmonton.",
        "Morrissey stated on Tuesday (May 20) that he will not require surgery for the injury he sustained in Saturday's (May 17) Game 6 against the Stars, per Mitchell Clinton of the Jets' official site.",
        "The Devils reported on Thursday (May 8) that Kovacevic underwent knee surgery and won't be ready for the start of training camp, per Amanda Stein of the Devils' official site.",
        "The Bruins said on Wednesday (Apr. 23) that Zacha had a minor surgery to address an undisclosed injury, according to general manager Don Sweeney, per Scott McLaughlin of WEEI.",
        "Guenther will miss the upcoming 2025 IIHF World Championship, per Utah Hockey Club Insider Craig Morgan.",
        "The Bruins said on Wednesday (Apr. 23) that Beecher might undergo surgery over the offseason, per Scott McLaughlin of WEEI.",
        "The Capitals said on Tuesday (Apr. 22) that Fehervary will miss the remainder of the playoffs after undergoing a successful procedure on his meniscus.",
        "Kreider ended the season dealing with a hand injury that may require offseason surgery, Peter Baugh of The Athletic.",
        "Kostin did not play in Monday's (Apr. 14) game against the Canucks. It is unlikely he will return this season.",
        "Schneider missed the final two games of the regular season after undergoing surgery to repair a torn labrum, according to Peter Baugh of The Athletic.",
        "Bjorkstrand underwent surgery for compartment syndrome according to Benjamin Pierce of the Lightning's official website.",
        "The Penguins said on Thursday (Apr. 10) that Nieto will miss the remainder of the season.",
        "The Penguins said on Thursday (Apr. 10) that Acciari will miss the remainder of the season.",
        "The Sharks said on Friday (Apr. 11) that Ferraro's season-ending injury is a broken ankle that won't require surgery, according to Sheng Peng of San Jose Hockey Now.",
        "Marino didn't accompany Utah on the team's season-ending three-game road trip, Belle Fraser of The Salt Lake Tribune reports Saturday (Apr. 12).",
        "Aman will miss the final three games of the 2024-25 campaign.",
        "The Islanders announced on Thursday (Apr. 3) that Duclair stepped away from the team for personal reasons.",
        "The Canucks said on Tuesday (Apr. 8) that Pettersson is unlikely to return before the end of the regular season but hasn't given up hope of getting back into the lineup, according to Sportsnet's Elliotte Friedman.",
        "Mukhamadullin underwent shoulder surgery last week, Max Miller of NHL.com reports Thursday (Apr. 17).",
        "The Penguins announced that Imama underwent successful biceps surgery on Saturday (Mar. 29) and will be out 4-6 months.",
        "Dickinson will miss the remainder of the 2024-25 campaign because of a wrist injury, according to Ben Pope of the Chicago Sun-Times.",
        "The Bruins said on Thursday (Apr. 10) that Kastelic wonâ\u0080\u0099t play before the end of the regular season.",
        "Norris' injury is a soft-tissue injury that the Sabres knew about before acquiring him from the Senators, according to Brian Koziol of WGR.",
        "The Ducks announced on Saturday (Mar. 29) that Johnston isn't expected to play again this season, according to Derek Lee of The Hockey News.",
        "The Flyers said on Thursday (Apr. 24) that Ristolainen underwent successful surgery on his right triceps tendon rupture and is expected to miss the next six months and training camp.",
        "The Rangers announced on Tuesday (Mar. 18) that Kaliyev will miss the remainder of the 2024-25 regular season and playoffs.",
        "The Utah Hockey Club announced on Sunday (Mar. 9) that Ingram is out indefinitely after entering the NHL/NHLPA Player Assistance Program.",
        "The Penguins said on Thursday (Apr. 10) that Novak will miss the remainder of the season.",
        "The New Jersey Devils placed F Jack Hughes on Long-term Injured Reserve on Wednesday (Mar. 5). He's expected to be ready for training camp.",
        "The Ducks announced on Saturday (Mar. 29) that Fabbri isn't expected to return before the end of the 2024-25 campaign, as per Derek Lee of The Hockey News.",
        "The Montreal Canadiens placed F Kirby Dach on the Injured Reserve on Sunday (Mar 2.) and is out for the season.",
        "Josi missed the last 25 games of the season due to a concussion, per Alex Daugherty of The Tennessean. But he is feeling good about where he's at in his recovery after finishing the 2024-25 season on injured reserve.",
        "The Red Wings said that Copp will miss the remainder of the 2024-25 campaign after undergoing surgery on Tuesday (Feb. 25) to repair a torn pectoral tendon.",
        "The Blue Jackets announced that Labanc was placed on injured reserve after undergoing shoulder surgery on Friday (Feb. 21) and will miss the rest of the season.",
        "Juulsen had a successful lower-body procedure on Friday (Feb. 28) and is expected to miss approximately 12 weeks, per Canucks' General Manager Patrik Allvin.",
        "The Bruins said on Thursday (Apr. 10) that McAvoy will not return this season, per Joe Haggerty of Boston Sports Journal.",
        "The Nashville Predators placed D Adam Wilsby on injured reserve on Friday (Feb. 21) and will miss the remainder of the season.",
        "The Rangers said on Monday (Apr. 21) that Edstrom has undergone surgery and should be fully healthy in time for training camp this spring, per Vince Z. Mercogliano of USA Today.",
        "The Islanders said on Saturday (Mar. 8) that Barzal remains on long-term injured reserve as he is not guaranteed to be back before the end of the regular season, per Andrew Gross of Newsday.",
        "The Predators announced on Tuesday (Feb. 18) that Lauzon will miss 4-6 months with a lower-body injury.",
        "The Ducks announced on Tuesday (Jan. 21) that McGinn had surgery to reconstruct his ACL and will be sidelined for 7-9 months.",
        "Regula was never taken off the season-opening injured reserve despite being waived by Boston and claimed by Edmonton on Wednesday (Dec. 11), per Daniel Nugent-Bowman of The Athletic.",
        "Varlamov had a knee procedure in December and feels he will be ready for training camp in September, Arthur Staple of The Athletic reports Saturday (Apr. 19).",
        "The Flames announced that Kirkland underwent successful ACL surgery on Wednesday (Dec. 4) and he will be out for the remainder of the season.",
        "The Maple Leafs reported on Saturday (Feb. 1) that Hakanpaa won't participate in the upcoming 4 Nations Face-Off.",
        "The Bruins announced on Sunday (Feb. 23) that Lindholm underwent surgery for a fractured patella and is likely out for the season, per Conor Ryan of The Boston Globe.",
        "Capitals' general manager Chris Patrick said on Friday (Mar. 7) that Milano recently sustained a significant setback in his recovery, per Sammi Silber of The Hockey News.",
        "The Flames announced that Mantha will require surgery on his ACL on Thursday (Nov. 14) and will miss the remainder of the 2024-25 season.",
        "The Colorado Avalanche placed D Tucker Poolman on long-term injured reserve. He didn't play in 2023-24 due to migraines and won't be available for the 2024-25 campaign either.",
        "The Philadelphia Flyers placed D Ryan Ellis on long-term injured reserve on Monday (Oct. 7).",
        "Grosenick underwent successful surgery on Wednesday (Oct. 2) to repair a torn ACL in his right knee and will not play this season. He is expected to make a full recovery and be ready for the start of the 2025-26 season.",
        "The St. Louis Blues reported on Tuesday (May 6) that Krug is not expected to resume his playing career according to general manager Doug Armstrong, per Lou Korac of NHL.com.",
        "The Blackhawks said on Thursday (Mar. 6) that Brossoit is not expected to play this season, according to Ben Pope of the Chicago Sun-Times."
    ]
}