{
    "date": [
        "2024-09-27",
        "2024-09-27",
        "2024-09-27",
        "2024-09-27",
        "2024-09-26",
        "2024-09-26",
        "2024-09-26",
        "2024-09-26",
        "2024-09-26",
        "2024-09-25",
        "2024-09-24",
        "2024-09-24",
        "2024-09-24",
        "2024-09-24",
        "2024-09-24",
        "2024-09-20",
        "2024-09-20",
        "2024-09-20",
        "2024-09-20",
        "2024-09-19",
        "2024-09-19",
        "2024-09-19",
        "2024-09-19",
        "2024-09-19",
        "2024-09-19",
        "2024-09-19",
        "2024-09-19",
        "2024-09-19",
        "2024-09-19",
        "2024-09-19",
        "2024-09-19",
        "2024-09-19",
        "2024-09-18",
        "2024-09-18",
        "2024-09-18",
        "2024-09-18",
        "2024-09-18",
        "2024-09-18",
        "2024-09-18",
        "2024-09-17",
        "2024-09-17",
        "2024-09-13",
        "2024-09-12",
        "2024-09-12",
        "2024-09-12",
        "2024-09-03",
        "2024-08-29",
        "2024-08-28",
        "2024-07-25",
        "2024-05-13"
    ],
    "player": [
        "John Gibson",
        "Santeri Hatakka",
        "Oliver Kapanen",
        "Anton Lundell",
        "Logan Stanley",
        "Jake Bean",
        "Matt Coronato",
        "Martin Pospisil",
        "Drew Doughty",
        "Filip Kral",
        "Ryan Lindgren",
        "Thomas Bordeleau",
        "Tomas Nosek",
        "Artemi Panarin",
        "Auston Matthews",
        "Artyom Levshunov",
        "William Carrier",
        "Teddy Blueger",
        "Ville Heinola",
        "Marc-Edouard Vlasic",
        "Shakir Mukhamadullin",
        "Nick Bjugstad",
        "Logan Couture",
        "John Marino",
        "Yaroslav Askarov",
        "Thatcher Demko",
        "Oskar Sundqvist",
        "Nathan Gaucher",
        "Pavel Mintyukov",
        "Kaiden Guhle",
        "Kevin Bahl",
        "Brett Pesce",
        "Michael Eyssimont",
        "Luke Glendening",
        "Erik Karlsson",
        "T.J. Oshie",
        "Evander Kane",
        "Jason Robertson",
        "Rasmus Dahlin",
        "Dakota Joshua",
        "Ilya Sorokin",
        "Artturi Lehkonen",
        "Quentin Miller",
        "Josh Filmon",
        "Luke Hughes",
        "Torey Krug",
        "Jesper Fast",
        "Laurent Brossoit",
        "Rafael Harvey-Pinard",
        "Valeri Nichushkin"
    ],
    "team": [
        "Anaheim Ducks",
        "New Jersey Devils",
        "Montreal Canadiens",
        "Florida Panthers",
        "Winnipeg Jets",
        "Calgary Flames",
        "Calgary Flames",
        "Calgary Flames",
        "Los Angeles Kings",
        "Pittsburgh Penguins",
        "New York Rangers",
        "San Jose Sharks",
        "Florida Panthers",
        "New York Rangers",
        "Toronto Maple Leafs",
        "Chicago Blackhawks",
        "Carolina Hurricanes",
        "Vancouver Canucks",
        "Winnipeg Jets",
        "San Jose Sharks",
        "San Jose Sharks",
        "Utah Hockey Club",
        "San Jose Sharks",
        "Utah Hockey Club",
        "San Jose Sharks",
        "Vancouver Canucks",
        "St. Louis Blues",
        "Anaheim Ducks",
        "Anaheim Ducks",
        "Montreal Canadiens",
        "Calgary Flames",
        "New Jersey Devils",
        "Tampa Bay Lightning",
        "Tampa Bay Lightning",
        "Pittsburgh Penguins",
        "Washington Capitals",
        "Edmonton Oilers",
        "Dallas Stars",
        "Buffalo Sabres",
        "Vancouver Canucks",
        "New York Islanders",
        "Colorado Avalanche",
        "Montreal Canadiens",
        "New Jersey Devils",
        "New Jersey Devils",
        "St. Louis Blues",
        "Carolina Hurricanes",
        "Chicago Blackhawks",
        "Montreal Canadiens",
        "Colorado Avalanche"
    ],
    "teamid": [
        24,
        1,
        8,
        13,
        52,
        20,
        20,
        20,
        26,
        5,
        3,
        28,
        13,
        3,
        10,
        16,
        12,
        23,
        52,
        28,
        28,
        59,
        28,
        59,
        28,
        23,
        19,
        24,
        24,
        8,
        20,
        1,
        14,
        14,
        5,
        15,
        22,
        25,
        7,
        23,
        2,
        21,
        8,
        1,
        1,
        19,
        12,
        16,
        8,
        21
    ],
    "type": [
        "Appendix",
        "Undisclosed",
        "Therapy",
        "Lower-body",
        "Knee",
        "Maintenance",
        "Maintenance",
        "Maintenance",
        "Ankle",
        "Leg",
        "Upper-body",
        "Lower-body",
        "Upper-body",
        "Lower-body",
        "Upper-body",
        "Foot",
        "Lower body",
        "Lower Body",
        "Ankle",
        "Upper-body",
        "Lower body",
        "Upper-body",
        "Groin",
        "Upper-body",
        "Lower body",
        "Knee",
        "Knee",
        "Lower body",
        "Lower body",
        "Appendix",
        "Lower body",
        "Knee",
        "Lower body",
        "Undisclosed",
        "Upper body",
        "Back",
        "Abdomen",
        "Foot",
        "Undisclosed",
        "Cancer",
        "Back",
        "Shoulder",
        "Shoulder",
        "Upper-body",
        "Shoulder",
        "Ankle",
        "Neck",
        "Meniscus",
        "Leg",
        "NHLPA"
    ],
    "notes": [
        "Gibson underwent emergency appendectomy surgery last night. He is expected to be out approximately 3-6 weeks.",
        "Hatakka is still being evaluated and out for Friday's (Sept. 27) game versus the New York islanders, per Amanda Stein of Daily Faceoff,",
        "Kapanen will not participate in Friday's (Sept. 27) on-ice sessions.",
        "Lundell is day-to-day with a lower-body injury. Wasn't going to be on the trip to Carolina today regardless, per Jordan McPherson of Miami Herald..",
        "Stanley is having surgery on his knee says Jets coach Scott Arniel. Heâ\u0080\u0099ll be out a minimum of four weeks, per Mitchell Clinton of the Winnipeg Jets.",
        "Bean didn't participate in Thursday's practice session for maintenance reasons.",
        "Coronato won't take part in Thursday's skate for maintenance reasons.",
        "Pospisil didn't participate in Thursday's practice session for maintenance reasons.",
        "The Kings announced that Doughty will undergo surgery to repair a fractured ankle and is month-to-month.",
        "Kral was labeled day-to-day with a lower-body injury Wednesday, Wes Crosby of NHL.com reports.",
        "Lindgren won't return to Tuesday's preseason game versus the Islanders after suffering an upper-body injury in a fight, per Antonio Losada of Athlon Sports.",
        "Bordeleau is week-to-week after suffering a lower-body injury, Sheng Peng of San Jose Hockey Now reports.",
        "Nosek is battling an upper-body injury and will miss some time as a result, Jameson Olive of the Panthers' official site reports.",
        "Panarin left Tuesday's preseason game versus the Islanders with a lower-body injury and is still under evaluation, Peter Baugh of The Athletic reports.",
        "Auston Matthews is dealing with an upper-body issue, per Leafs coach Craig Berube.",
        "D Artyom Levshunov is not expected to play in any preseason games. As per Scott Powers of The Athletic.",
        "Carrier will not be an option against the Lightning on Tuesday, Chip Alexander of The Raleigh News & Observer reports.",
        "F Teddy Blueger will not take part in Tuesday's preseason contest against Seattle, Ben Kuzma of The Vancouver Province reports.",
        "Heinola who has an ankle infection, underwent surgery, Scott Billeck of the Winnipeg Sun reports Thursday.",
        "Vlasic will be sidelined versus Anaheim on Tuesday, Max Miller of NHL.com reports.",
        "Mukhamadullin didn't take part in Tuesday's practice, per Curtis Pashelka of The San Jose Mercury News.",
        "Bjugstad will be listed as week-to-week and is not taking part in the start of training camp, per Craig Morgan of ALLCITY Network.",
        "Couture will not be available for the start of training camp, per rotowire.com.",
        "Marino is considered week-to-week with an upper-body injury and will not be on the ice Thursday for the start of training camp, according to Craig Morgan of ALLCITY Network.",
        "Askarov was not in attendance for Tuesday's game-day skate and will miss out versus Anaheim, Curtis Pashelka of The San Jose Mercury News reports.",
        "Demko has made a lot of progress over the last 2-3 weeks, but said Thursday there is still no timetable for his return, Harman Dayal of The Athletic reports.",
        "Sundqvist will take part in practices during training camp, but he isn't expected to participate in any preseason games, Jeremy Rutherford of The Athletic reports.",
        "Gaucher has a lower-body injury and is considered day-to-day ahead of training camp.",
        "Mintyukov is dealing with a lower-body injury and is day-to-day to begin training camp.",
        "Guhle resumed skating on his own this morning and is being evaluated on a daily basis.",
        "The Calgary Flames announced that D Kevin Bahl will not participate in either of Calgary's split-squad games against Edmonton.",
        "Pesce is making progress from his season-ending surgery he had in Carolina and he's considered week-to-week, per NJ Devils Reporter Amanda Stein.",
        "General Manager Julien BriseBois said Mikey Eyssimont has a lower-body injury and the hope is that he can return to practicing on a regular basis by the end of camp, with an eye toward a mid-October return.",
        "Glendening could return by the Oct. 11 opener, Tampa Bay Lightning GM Julien BriseBois said.",
        "Karlsson continues to be classified as day-to-day but should be available for Opening Night against the Rangers on Oct. 9 after coach Mike Sullivan told reporters Thursday.",
        "Oshie will be put on long-term injured reserve due to a chronic back injury that's expected to cost him the entire 2024-25 campaign, per Tom Gulitti of NHL.com.",
        "Kaneâ\u0080\u0099s recovery from abdominal surgery is expected to take a minimum of five months. They suggest it could be six months â\u0080\u0094 or longer, per Daniel Nugent-Bowman of The Athletic. ",
        "Jason Robertson had surgery on his foot on July 31. Heâ\u0080\u0099s been non-weight bearing the last six weeks. He wonâ\u0080\u0099t be skating to start training camp with the main team. Heâ\u0080\u0099ll miss majority of camp, Jim Nill says.",
        "Dahlin, as expected, won't play in Tuesday's preseason clash with Pittsburgh, Lance Lysowski of The Buffalo News reports.",
        "Joshua announced that he underwent surgery for testicular cancer and will not be ready to join the team for training camp.",
        "Sorokin had surgery to address a back injury this offseason but is not expected to miss any regular-season action, Stefen Rosner of NHL.com reports.",
        "Lehkonen will not be able to participate fully at the start of training camp, John Matisz of The Score reports.",
        "Miller will be undergoing surgery to repair damage to his right shoulder, per Jonathan Larivee of Hockey Feed.",
        "Filmon will not participate in the team's Prospects Challenge due to an upper-body injury and is considered week-to-week.",
        "The New Jersey Devils announced that D Luke Hughes suffered a left shoulder injury earlier this month during off-season training. Hughesâ\u0080\u0099 recovery time is approximately six-eight weeks.",
        "Krug will undergo surgery on his left ankle and will miss the entire 2024-25 season.",
        "Jesper Fast has undergone neck surgery, and is not expected to play in the upcoming season. per Carolina Hurricanes.",
        "Brossoit underwent meniscus repair surgery yesterday, out 5-7 weeks, which puts him back late end of training camp or beginning of regular season, per Frank Seravalli of Daily Faceoff.",
        "Harvey-Pinard underwent successful surgery on Thursday after suffering a broken leg. The recovery period for the 25-year-old winger is estimated to be four months.",
        "Nichushkin was placed in Stage 3 of the NHL/NHLPA player assistance program and suspended for a minimum of six months without pay for violating the terms of Stage 2, the NHL and NHLPA announced."
    ]
}